[{"lang": "lang", "uuid": "e360fbcb-8351-4c20-8473-45675c93d60e", "title": "Title of the book", "translate_to": "lang", "data": [{"country": "Alabama", "recipes": [{"serving": "8", "description": "The fried green tomatoes are legendary in Alabama, they even inspired novella and film called Fried Green Tomatoes at the Whistle Stop Café.", "preparing_time": "40", "ingredients": ["#Mayonnaise:", "1 ear corn", "1/3 cup mayonnaise", "2 tablespoons sour cream", "1 roasted poblano chile, fresh or canned, seeded", "Kosher salt and freshly ground pepper", "#Tomatoes:", "2 large green tomatoes (about 1 pound)", "Oil, for frying", "2 cups panko breadcrumbs", "1 teaspoon cayenne pepper", "Kosher salt", "All-purpose flour, for dredging", "2 cups buttermilk", "1 lime, cut in wedges"], "image": {"source_uri": "https://www.flickr.com/photos/jesswebb/5052197273", "uri": "https://c1.staticflickr.com/5/4088/5052197273_0af6d4a708_b.jpg", "description": "Fried Green Tomatoes with Green Chile Mayonnaise"}, "title": "Fried Green Tomatoes with Green Chile Mayonnaise", "directions": "§  Cut the tomatoes into slices of about 3/4 inch\n§  Heat the oil in a medium large saucepan\n§  Prepare 3 bowls – one with panko, cayenne spice and salt, second with flour and the third with buttermilk\n§  First dredge the tomatoes in the buttermilk, then in the flour, then in the buttermilk again and finish with the spicy panko, coat thoroughly\n§  Fry the tomatoes in small batches until light brown\n§  Let it drain on paper towels\n§  #Mayonnaise – boil the corn in salted water, let it cool\n§  Remove the kernels, drain the liquid from the cob\n§  Mix the corn and the liquid with mayonnaise, add sour cream and chilli, mix in a blender until fine, season with salt and pepper\n§  Serve the dish with the mayonnaise, decorate with lime\n", "uuid": "fce4779a-9071-4ca0-9d13-678dca7c3b44"}, {"serving": "8", "description": "Cornbread is an Alabama's traditional side dish for a variety of dishes. It's delicious with hearty winter soup, chili or stew meat.", "preparing_time": "35", "ingredients": ["1 Tbsp bacon drippings", "2 cups cornmeal OR 1 1/2 cups cornmeal and 1/2 cup flour", "2 teaspoons baking soda", "1 teaspoon salt", "1 Tbsp sugar (optional)", "1 egg (optional)", "1 1/4 cups buttermilk", "6 Tbsp unsalted butter, melted"], "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Skillet_cornbread_(cropped).jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Skillet_cornbread.jpg", "description": "Alabama Cornbread "}, "title": "Alabama Cornbread ", "directions": "§  Prepare a large saucepan, add bacon drippings and put it in the oven preheated to 400°F\n§  Mix all the dry ingredients in a bowl\n§  Whisk an egg with the buttermilk, add it to another bowl along with butter\n§  Take the skillet out from the oven, put in the cornbread dough and bake for 20 minutes (try if its done with a toothpick)\n§  Let it cool down for 10 to 30 minutes in the pan before serving it\n", "uuid": "03e7eb0e-a8c9-4a2b-a68e-0663cffaa8d6"}]}, {"country": "Alaska", "recipes": [{"serving": "6 to 8", "description": "Old traditional Alaska soup broth with moose meat, which is a typical delicacy for Alaska. The moose borsch is quite similar to the Russian borsch.\n", "preparing_time": "400", "ingredients": ["1 lb. ground moose meat", "8 cups cold water", "1/3 cup white beans", "1 large beet", "1 large carrot", "2 potatoes, sliced", "1 onion, diced", "1/3 head cabbage cut into noodle-like pieces", "6 oz. tomato paste", "Sour cream"], "image": {"source_uri": "https://www.flickr.com/photos/tanyakikis/1807977385", "uri": "https://c1.staticflickr.com/3/2198/1807977385_d7c6d3f4c3.jpg", "description": "Moose Borsch"}, "title": "Moose Borsch", "directions": "§  Prepare the beans by soaking them in warm water for 3-4 hours\n§  Cut the meat and put it in a large skillet, add 8 cups of cold water\n§  Cover with a lid and heat on high heat, bring to a boil\n§  When boiling, add the beans, whole beet and carrot, reduce the heat and cook for an hour\n§  After 1 hour remove the beat and carrot, add the potatoes, bring to a boil\n§  Add the cabbage and cook for approximately 15 minutes\n§  Chop the onion, grate the carrot and the beet and add it to the skillet along with the tomato paste, season with salt and pepper according to your taste\n§  Cook for 5 to 7 minutes with all the new ingredients, set aside for 20 minutes\n§  Serve hot with sour cream\n", "uuid": "023c7866-d418-4c06-aac2-bd22d567e133"}, {"serving": "7 strips", "description": "It is a popular dessert all over North America, but originally from Alaska. For this recipe is idela Rich Alaskan King Salmon, which has perfect meat for smoking and drying process.", "preparing_time": "18 hr 40", "title": "Alaska Salmon Candy", "image": {"source_uri": "http://www.smoking-meat.com/january-23-2014-smoked-salmon-candy", "uri": "http://www.smoking-meat.com/image-files/2014-IMG_2620-featured.jpg", "description": "Alaska salmon candy"}, "ingredients": ["1 1/2 cups granulated sugar", "1/2 cup kosher salt", "1 pound skinless Alaskan Kingsalmon fillet, cut into 1/2-inch strips", "1/2 cup maple syrup", "3 tablespoons dark brown sugar", "2 teaspoons soy sauce", "1 1/2 teaspoon liquid smoke", "1 teaspoon coarsely cracked black pepper"], "directions": "§  Mix sugar with salt, spread onto a large plate and place the smoked salmon on the mixture, coat thoroughly from both sides\n§  Put it in the fridge for 12 hours\n§  Preheat the oven to 170°F\n§  Scrape all the sugar from the fish, then dry it completely with a paper towel\n§ Place the strips on a foil lined baking sheet\n§  Let the salmon dry at room temperature for 30 minutes\n§  Mix together all the remaining ingredients and glaze each stripe in it\n§  Place in the oven, glaze and turn over the salmon every hour\n§  An hour before it is finished, instead of coating it, season with black pepper\n§  Bake until the stripes are slightly sticky but hardened, approximately for 6 hours\n§ Serve at room temperature or store for later (for 1 week)", "uuid": "70910a17-5941-405d-9ca2-b3a8549c2249"}]}, {"country": "Arizona", "recipes": [{"serving": "6", "description": "This adored burrito si originally from Tucson in Arizona. Chimichanga was born between the 1920's and 1950's and its flavour is influenced by the neighboring Mexican state Sorona.", "preparing_time": "110", "ingredients": ["1/2 cup vegetable oil, plus more for deep-frying", "2 pounds boneless pork shoulder, cut into rough 1-inch chunks", "1 teaspoon coriander seeds, crushed", "1 teaspoon whole cumin seeds", "6 cloves garlic, smashed", "Kosher salt and freshly ground black pepper", "One 12-ounce bottle pilsner beer, such as Corona", "1 tablespoon sherry vinegar", "8 ounces tomatillos, husks removed, rinsed and quartered (about 3 medium)", "1 small red onion, quartered (about 8 ounces)", "1/2 bunch fresh cilantro with tenders stems (1 cup packed)", "3 canned chipotles in adobo sauce", "1/4 cup whole raw almonds", "1 1/2 cup shredded yellow Cheddar", "Six 12-inch flour tortillas", "Guacamole, pico de gallo and sour cream, for serving"], "image": {"source_uri": "https://en.wikipedia.org/wiki/Burrito", "uri": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Breakfast_burritos.jpg", "description": "Pork Chimichanga"}, "title": "Pork Chimichanga", "directions": "§  On a dutch oven heat ¼ cup of oil over medium-high heat, saute coriander and cumin seeds on it, add the pork, season with salt and pepper and fry until the pork is no longer pink (about 15 minutes), stir as needed\n§  Add 8 ounces of beer and vinegar, stir properly from the bottom of the pan\n§  Cook on medium-low until the meat is mild (about 45 minutes), then take the pork out and let cool, shred it and then give it back in the skillet, remove from the heat\n§  Blend the onion, almonds, tomatillos, add cilantro and chipotles and 4 ounces of beer\n§  Mix until fine, season with salt\n§  Saute the green sauce on ¼ cup of oil on medium heat, cook for about 15 minutes until the sauce is reduced by half, stir frequently\n§  Pour 4 inches of oil in a heavy bottomed pot for frying the chimichangas, heat to 375 degrees F\n§  Mix the reduced green sauce with the shredded meat\n§  Prepare the tortillas, spread cheese in the center of each, add the pork along the tortilla sideways, leave 3 inches at each end\n§  Roll the bottom half over the filling, fold the sides, press it tight, secure with toothpicks if needed (not through the filling!)\n§  Deep fry until light brown (about 3 minutes)\n§  Serve with guacamole, pico de gallo or sour cream", "uuid": "056c18cc-b9c7-422b-b867-f1372626ead6"}, {"serving": "7", "description": "This delicious pie is wonderful as a trimmings to any Barbecued meat, especially pork. The main ingredient is sweet onion, which is sweeter and have guite different flavor than common onion.\n", "preparing_time": "75", "ingredients": ["1 1/2 cups buttery round crackers, crumbled", "6 tablespoons butter, softened", "2 cups thinly sliced sweet onions", "2 cloves garlic, minced", "1 tablespoon minced fresh chives", "3/4 cup whole milk", "2 eggs", "1/2 teaspoon salt", "3/4 cup shredded Cheddar cheese", "1 pinch paprika", "1 tablespoon chopped fresh parsley"], "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Caramelized_onion_pie.jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/c/ce/Caramelized_onion_pie.jpg", "description": "Arizona Sweet Onion Pie"}, "title": "Arizona Sweet Onion Pie", "directions": "§  Put crackers and 4 tablespoons of butter into the blender, mix until smooth\n§  Line a 9 inch pan with the pie crust, press it tight\n§  Put it in the fridge until needed\n§  Preheat the oven to 350°F\n§  Take a heavy skillet and heat the butter on medium heat\n§  Stir fry onions and garlic (about 12 minutes) until soft\n§  Spread the onions on the crust\n§  Whisk eggs with milk, season with salt and mix in the chives\n§  Cover the onions with the mixture and scatter with cheese and paprika\n§  Bake in the oven for approximately 35 minutes \n§  Decorate with parsley, serve hot or at room temperature\n", "uuid": "f1717ed1-c8b3-446b-9c28-d8e8de104382"}]}, {"country": "Arkansas", "recipes": [{"serving": "8 to 10", "description": "In many rural areas of Arkansas, this breakfast staple is offered instead of oatmeal.", "preparing_time": "75", "ingredients": ["1/4 cup butter or margarine", "3 eggs", "1 cup sugar", "3 cups milk", "2 1/2 cups cooked regular rice, cooled", "2 tsp vanilla extract", "3/4 tsp ground nutmeg", "1/2 tsp salt", "3/4 cup grated coconut"], "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Rice_pudding_vanilla_cinnamon.jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/Rice_pudding_vanilla_cinnamon.jpg/640px-Rice_pudding_vanilla_cinnamon.jpg", "description": "Rice Pudding"}, "title": "Rice Pudding", "directions": "§  Put ½ cup of butter in a 12×8×2 inch baking pan\n§  Let the butter melt in the oven, then remove and set aside\n§  Prepare a large bowl, whisk eggs with sugar, add milk, spice with vanilla, nutmeg and salt, add rice\n§  Spread the mixture on the pan, decorate with coconut powder\n§  Bake in a preheated oven to 325°F for 1 hour without a lid\n§  Serve hot", "uuid": "54bfed3f-6580-4864-b067-be6a7a83a365"}, {"serving": "12", "description": "These popular fried pies are wonderful hot or cold and they are so versatile because they can be filled with your favorite fruits.", "preparing_time": "40", "ingredients": ["#Pastry:", "3 cups all-purpose flour", "1 teaspoon salt", "3⁄4 cup Crisco or 3⁄4 cup other good vegetable shortening", "1 egg, lightly beaten", "1⁄4 cup cold water", "1 teaspoon vinegar (preferably white vinegar)", "#Filling:", "3 cups dried fruit (apricots, peaches, apples)", "1 1⁄2 cups water", "1 cup sugar", "1⁄4 teaspoon cinnamon", "1⁄4 teaspoon ground allspice"], "image": {"source_uri": "https://www.flickr.com/photos/ralphandjenny/7623695898", "uri": "https://c2.staticflickr.com/8/7117/7623695898_faaf90837a_b.jpg", "description": "Fried Fruits Pies"}, "title": "Fried Fruit Pies", "directions": "§  Mix flour with salt, add the shortening and process with your hands or a blender until the mixture is crumbly\n§  Whisk an egg with water, pour over the flour mixture\n§  Add the vinegar and knead until the ingredients are well combined\n§  Make the dough into a cylinder shape and refrigerate in a plastic wrap for at least an hour\n§  Cook the dried fruit in the water on a very low heat for 30-45 minutes or until very soft (add water if needed)\n§  Let it cool, mill the fruit a little and put it in a bowl\n§  Mix in the spices and sugar\n§  Take the refrigerated dough and cut it to four quarters, then every quarter to 3 equal pieces (you should have 12 balls of dough in the size of an egg)\n§ Place the dough on a dry floured surface\n§  Roll every ball into a circle\n§  Spread about 2 tablespoons of the filling onto one side of the circle, wet the edges with water and fold the dough over the mixture, make a moon shaped pies\n§  Press the edges with a fork properly\n§  Preheat a deep fryer to 350°F and fry the pies one by one (for about 4 minutes) to light brown colour\n§  Place the pies on paper towels, let the oil drain out\n§  Sprinkle with powdered sugar, serve", "uuid": "b26fe74e-997e-4ec6-9fb0-10cc3dae7f6d"}]}, {"country": "California", "recipes": [{"serving": "5", "description": "California roll was supposedly created at a Japanese restaurant Tokyo Kaikan in Los Angeles about 1973. And it's known all around the world.", "preparing_time": "110", "title": "California Roll", "image": {"source_uri": "https://www.flickr.com/photos/angells60640/3985265755", "uri": "https://c2.staticflickr.com/4/3518/3985265755_fe2c28bdb2_b.jpg", "description": "California Roll"}, "ingredients": ["4 cups water", "2 cups uncooked white rice ", "1/2 cup seasoned rice vinegar ", "1 teaspoon white sugar, or as needed", "1 teaspoon salt, or as needed ", "1/4 pound cooked crab meat, drained of excess liquid and shredded ", "1 tablespoon mayonnaise ", "5 sheets nori (dry seaweed) ", "1 avocado, sliced ", "1/4 cup red caviar, such as tobiko ", "1 English cucumber, seeded and sliced into strips ", "2 tablespoons drained pickled ginger, for garnish ", "2 tablespoons soy sauce, or to taste ", "1 tablespoon wasabi paste"], "directions": "§  Prepare a large pan, put rice and water and bring to a boil,then reduce to medium-low heat and cover\n§ Cover a sushi rolling mat in a plastic wrap, keep it for later\n§  Cook the rice for 20-25 minutes until all the water is absorbed and the rice is soft\n§  Put the rice into a bowl, sprinkle with vinegar and mix carefully with a wooden spoon, season with 1 spoon of salt and 1 spoon of sugar\n§  Let cool to room temperature for about 30 minutes\n§  In another bowl, mix the crab meat with the mayonnaise, coat the meat thoroughly\n§  Spread thin layer of rice on the nori sheet\n§  Place the nori on a rolling mat, the rice side down\n§  Start topping with avocado (about 2-3 slices), then the crab mix (2-3 tablespoons), then add tobiko on one side and sliced cucumber on the other side\n§  Roll the nori carefully, press it tight\n§  Remove from the mat, sprinkle with tobiko, wrap in plastic wrapper and let it cool in the fridge\n§  When serving, unwrap from the plastic, cut to 6 slices using a wet knife\n§  Serve with classic pickled ginger, wasabi and soy sauce", "uuid": "8c60e2c6-1569-4582-8a74-eb442d001ba7"}, {"serving": "4 to 8", "description": "California burger is special because of avocado, which is one of the California's edible state symbols.", "preparing_time": "50", "title": "California Turkey Burger", "image": {"source_uri": "https://en.wikipedia.org/wiki/Regional_street_food", "uri": "https://upload.wikimedia.org/wikipedia/commons/f/f9/D%C3%B6ner_kebab.jpg", "description": "California Turkey Burger"}, "ingredients": ["#Burger:", "1 lb ground turkey", "4 garlic cloves, minced", "1⁄4 cup red onion, minced", "1⁄4 cup red bell pepper, minced", "1⁄2 teaspoon salt", "1⁄2 cup cheese, grated (use a sharp cheddar, or pepper jack)", "1 egg, beaten", "1⁄2 cup breadcrumbs (Panko-style if possible)", "#Dressing:", "1 avocado, ripe and smashed", "1⁄2 cup nonfat yogurt (strained Greek-style is great)", "1 tablespoon lemon juice, fresh", "1⁄4 teaspoon hot pepper sauce", "1⁄4 cup artichoke heart, minced", "1 tomatoes, seeded and chopped", "1⁄2 teaspoon salt", "1⁄4 teaspoon pepper, ground"], "directions": "§  #Patties – mix the ground turkey with the spices and make burgers (4-8, depending on the size)\n§  #Dressing – blend all the ingredients in a mixer, leave a few chunks\n§  Cook the burgers either on a grill or on a pan\n§  Serve on a toasted sourdough bread and avocado dressing\n§  Decorate with baby spinach, onion or tomato and alfafa sprouts\n", "uuid": "9c7d85af-ac0d-4b50-8f73-5cfdf3ba7d33"}]}, {"country": "Colorado", "recipes": [{"serving": "24", "description": "These wonderful cinnamon rolls are among the Colorado's national dishes. And now you can bake your own slice of heaven.", "preparing_time": "180", "ingredients": ["#Sweet Dough:", "2 packages active dry yeast (5 teaspoons)", "3/4 cup warm water", "3/4 cup sugar", "1/2 cup vegetable shortening (such as Crisco), melted", "1/4 cup plus, 6 tablespoons unsalted butter, melted, plus extra butter at room temperature for the bowl and pan", "3 eggs", "1 1/2 cups milk", "6-7 cups bread flour", "1 teaspoon salt", "#Filling:", "1/2 cup granulated sugar1/4 cup brown sugar", "1 tablespoon powdered cinnamon", "#Glaze:", "3/4 cup confectioners' sugar", "1 teaspoon vanilla extract", "Milk"], "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Cinnamon_roll_on_white_plate,_July_2008.jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/3/37/Cinnamon_roll_on_white_plate,_July_2008.jpg", "description": "Colorado Cinnamon Rolls"}, "title": "Colorado Cinnamon Rolls", "directions": "§  #Dough – put yeast in warm water, it is ready to use when it is bubbling\n§  In a blender mix sugar, shortening, ¼ cup of melted butter, milk and eggs\n§  Add the yeasty water, blend together\n§  In another bowl mix flour and salt together\n§  Attach the dough hook to the blender above the bowl with the liquid\n§  Add flour cup at a time to the liquid ingredients, mixing it in the meantime\n§  Mix properly until the dough no longer sticks to the edges of the bowl\n§  Place the dough on a flat surface and knead until soft (5 minutes)\n§  Put it in a buttered bowl, cover with plastic wrap and keep at a warm place for about an hour to rise\n§  Preheat the oven to 350°F\n§  #Filling – mix granulated sugar, white sugar and cinnamon\n§  Take the dough from the bowl, roll it to a rectangle about a quarter inch thick, 24 inch long and 10 inch wide\n§  Cover the rectangles with melted butter, sprinkle with the cinnamon filling\n§  Roll the dough from one long side to the other, cut uneven ends\n§  Place the rolls on a buttered pan and put them in the preheated oven, bake for 20 minutes until golden\n§  #Glaze – whisk the sugar, vanilla and milk\n§  After 20 minutes take the rolls out of the oven, let them sit for 5 minutes and then spread the glaze over them\n§  Serve hot", "uuid": "d20d09b1-b606-4042-b376-babd12a43a67"}, {"serving": "4", "description": "The Denver omelet is a bit like the Spanish omelet, but with different non-egg ingredients. And it's ideal for breakfast.", "preparing_time": "35", "title": "Denver Omelet", "image": {"source_uri": "https://en.wikipedia.org/wiki/Spanish_omelette", "uri": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Tortilla_de_patata_y_cebolla.JPG", "description": "Denver Omelet"}, "ingredients": ["2 tablespoons butter", "1 medium onion, chopped", "1 red bell pepper, chopped", "1 cup chopped cooked ham", "8 eggs", "1⁄4 cup milk", "1 cup shredded cheddar cheese", "salt & freshly ground black pepper"], "directions": "§  Melt butter in a skillet, add the chopped red bell pepper and stir with the onion\n§  When soft, add the ham and fry for another 2 minutes\n§  Grease a round pan and preheat the oven to 400°F\n§  Whisk eggs with milk, mix in with the pepper, onion and the ham, add cheese and season with salt and pepper\n§  Pour it on the prepared pan and place in the oven\n§  Bake for 20 minutes or until golden, serve warm\n", "uuid": "8c2e5cac-8828-4966-a3f4-4a229d94fd4f"}]}, {"country": "Connecticut", "recipes": [{"serving": "15", "description": "These delicious cookies are among the Connecticut's national dishes. But Snickerdoodle came from Germany and the name originated from the German word Schneckennudeln, which means snail dumpling.\n", "preparing_time": "50", "title": "Snickerdoodles Cookies", "image": {"source_uri": " https://commons.wikimedia.org/wiki/File:Cookies_-_Snickerdoodles.jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/7/76/Cookies_-_Snickerdoodles.jpg", "description": "Snickerdoodles Cookies"}, "ingredients": ["½ Cup Butter or Margarine (Softened) – I use butter.", "½ Cup Shortening (I use butter flavored shortening)", "1 ½ Cup Sugar", "2 ¾ Cup All Purpose Flour", "2 Teaspoons Cream of Tartar", "2 Eggs", "1 Teaspoon Baking Soda", "¼ Teaspoon Salt", "You will also need cinnamon and sugar for topping."], "directions": "§  Prepare a bowl, mix cream of tartar, flour, salt and baking soda\n§  In another bowl mix shortening, butter, eggs and sugar, blend thoroughly until fluffy\n§  Slowly pour the flour mixture into the other bowl, stir together properly, let it cool in the fridge for 30 minutes\n§  Preheat the oven to 400°F\n§  Mix 2 tablespoons of sugar and 2 tablespoons of cinnamon\n§  After 30 minutes, remove the dough from the fridge and make it into small balls, about 1 tablespoon of dough each\n§  Cover every ball of dough in the sugar-cinnamon mixture\n§  Place them on an aluminum foil, leave space between them as they will melt in the baking process\n§  Bake for 6-8 minutes\n§  Place the baked cookies on an absorptive paper, let the fat drain\n§  Eat right away or store in a cookie tin", "uuid": "324dca84-7a5c-4cb6-8e28-fbcb20794bc2"}, {"serving": "6", "description": "Mystic Pizza is one of the state dishes of Connecticut. Its name been created thanks to the romantic comedy \"Mystic Pizza\". In the movie the owner of the local pizzeria guarded her family sauce recipe with a secret blend of Portuguese spices. So there are many variants of this Mystic Pizza.", "preparing_time": "100", "ingredients": ["1 1/2 cups all-purpose flour, divided ", "1 teaspoon sugar", "1 package quick-rise yeast (2 1/2 teaspoons)", "1/2 cup warm water (105° to 115°)", "1 teaspoon olive oil", "1/2 teaspoon salt, divided", "Cooking spray ", "2 teaspoons cornmeal", "3 garlic cloves, minced", "1 tablespoon chopped fresh or 1 teaspoon dried oregano", "1 tablespoon minced fresh cilantro", "3/4 teaspoon fennel seeds", "1/4 teaspoon crushed red pepper", "1 (8-ounce) can no-salt-added tomato sauce ", "1 1/2 cups (6 ounces) shredded part-skim mozzarella cheese"], "image": {"source_uri": "https://pixabay.com/cs/pizza-italsk%C3%A1-ve%C4%8De%C5%99e-raj%C4%8De-ob%C4%9Bd-493510/", "uri": "https://pixabay.com/static/uploads/photo/2014/10/18/17/41/pizza-493510_640.jpg", "description": "Mystic Pizza"}, "title": "Mystic Pizza", "directions": "§  Dissolve the yeast in a warm water, set aside for 5 minutes\n§  Mix with 1 ¼ cup of flour, oil and ¼ tablespoon of salt, stir to make a soft dough\n§  On a floured surface knead the dough until it is elastic (about 10 minutes), use the remaining flour spoon by spoon, until the dough is no longer sticky\n§  Place into a greasy bowl, let it stand until the dough is twice its' size (about 30 minutes)\n§  Preheat the oven to 450°F\n§  Put the pizza dough on a lightly floured surface, roll into 12 inch circle\n§  Spray the baking sheet with cooking spray, sprinkle with cornmeal and place the pizza circle on it, crimp the edges a little to create a rim\n§  Let it stand for 10 minutes (covered)\n§  Saute the garlic for 2 minutes, then add the spices and tomato sauce, stir occasionally and cook uncovered on a medium heat for approximately 20 minutes\n§  Pour the mixture from the pan onto the pizza dough, sprinkle with cheese and bake in the oven until the cheese is melted and the crust is light brown (about 10 minutes)\n§  Cut into slices and serve hot", "uuid": "b92af53a-b9cf-4e33-804a-96ffe2e644d3"}]}, {"country": "Delaware", "recipes": [{"serving": "8", "description": "This delicious pie is among the Delaware's national dishes. And it is the perfect dessert after Sunday lunch.", "preparing_time": "75", "title": "Peach Custard Pie", "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Peach_custard_pie_(1416028394).jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Peach_custard_pie_(1416028394).jpg", "description": "Peach Custard Pie"}, "ingredients": ["#Crust:", "1 1⁄3 cups flour", "1⁄2 teaspoon salt", "1⁄2 cup shortening or 1⁄2 cup butter", "3 -4 tablespoons water", "#Filling:", "4 medium size peaches", "1(8 ounce) container sour cream", "3 egg yolks", "1 cup sugar", "1⁄4 cup flour", "1 teaspoon vanilla extract", "#Streusel Topping:", "4 tablespoons butter", "1⁄2 cup flour", "1⁄4 cup sugar", "1 teaspoon cinnamon (optional)"], "directions": "§  #Crust – mix flour, salt and butter with a fork, make crumbs, start adding water one tablespoon at a time until the dough is soft\n§  Form a ball, then roll it into a circle about 1/8 inch thick\n§  Spread the dough over a pie plate, leave 1 inch overhang, cut the rest of the dough\n§  Place it on the pie plate\n§  Preheat the oven to 425°F\n§  #Filling – in a large bowl whisk the sour cream, flour, sugar, egg yolks and vanilla and mix until smooth\n§  Peel peaches and slice them to ¼ inch thickness, start folding them on the pie crust in circles (save some peaches for decorating the top later)\n§  Pour the sour cream mixture over the peaches\n§  Bake in the oven for 30 minutes, then set aside\n§  #Streusel topping – crumble butter, flour, sugar and cinnamon\n§  Sprinkle it on the top of the pie and bake for additional 15 minutes\n§  Decorate with the remaining peaches, serve hot or let it cool down to room temperature", "uuid": "2b7a3d46-05d9-437d-9461-5564388cb5eb"}, {"serving": "3", "description": "Soft crabs are easy to prepare and a true gourmet seafood delicacy. Soft-shell crab is a culinary term for crabs which have recently molted their old exoskeleton and are still soft.", "preparing_time": "25", "title": "Soft Shell Crabs", "image": {"source_uri": "https://www.flickr.com/photos/misskelly/8681545553", "uri": "https://c1.staticflickr.com/9/8257/8681545553_528803d2de.jpg", "description": "Soft Shell Crabs"}, "ingredients": ["6 soft shelled crabs, cleaned and rinsed", "1 cup all-purpose flour", "2 tablespoons Old Bay Seasoning", "2 eggs, beaten", "2 tablespoons milk", "6 tablespoons extra virgin olive oil", "1⁄4 cup butter", "2 tablespoons capers, drained", "1⁄2 cup dry white wine (I always use Sauvignon Blanc)", "4 medium lemons, juice of", "2 tablespoons fresh flat-leaf parsley, chopped"], "directions": "§  In a large bowl mix flour with the old bay seasoning\n§  In another bowl whisk the eggs and milk\n§  Start dredging the meat first in the eggs, then in the spicy flour, coat properly from all sides\n§  Preheat oil in a large skillet over medium heat\n§  Fry the crab in small batches, 3 minutes on each side until nutty brown\n§  Place the crab on a serving platter\n§  Add the butter to the heated oil, let it brown and then add the capers and the wine, cook for 1 minute\n§  Add the lemon juice and parsley to the pan, cook for 2 minutes or until reduced by a third\n§  Pour the sauce over the crabs, serve", "uuid": "599fc03e-3841-4faf-9cb6-b6c2f6f419ba"}]}, {"country": "Florida", "recipes": [{"serving": "9", "description": "No wonder it's the Florida state pie, it's perfect with seafood or any light dish and an ideal finish for any meal. Key limes are also known as Mexican or West Indian limes.", "preparing_time": "190", "ingredients": ["#Crust:", "1/3 of a 1-pound box of graham crackers", "5 Tablespoons of melted unsalted butter", "1/3 cup of sugar ", "#Filling:", "4 egg yolks", "2 teaspoons of lime zest - be sure to zest before you squeeze the juice!", "1 (14-ounce) can sweetened condensed milk", "2/3 cup of freshly squeezed lime juice (approximately 24-36 limes depending on freshness of limes), or 6-8 regular fresh limes (again, depending on freshness)", "#Meringue topping:", "4 egg whites", "¼ teaspoon, cream of tartar", "2 tablespoons sugar"], "image": {"source_uri": "https://www.flickr.com/photos/51018933@N08/4683277105", "uri": "https://c1.staticflickr.com/5/4033/4683277105_73f5dec5fe.jpg", "description": "Key Lime Pie"}, "title": "Key Lime Pie", "directions": "§  Preheat the oven to 350°F\n§  #Crust – place the Graham crackers into a zip-lock bag, seal and crush the crackers with a rolling pin\n§  Scatter the cracker crumbs into a bowl, add the melted butter and sugar and mix until well combined\n§  Press the dough properly to the pie pan, cover the edges as well\n§  Bake in the oven for 8 minutes, then let it cool down (keep the oven on)\n§  #Filling – separate the yolks and the whites, now use the yolks (keep the whites for later use)\n§  Grate about 2 tablespoons of lime skin, then squeeze 2/3 cup of lime juice from all the limes\n§  In a blender combine 4 yolks, add 2 tablespoons of the lime skin and mix on high speed until fluffy (about 5 minutes)\n§  Add the condensed milk gradually, beat for another 3-4 minutes\n§  Reduce the speed to slow, start pouring the lime juice and mix just until combined (not longer)\n§  Pour the mixture over the pie crust and bake for 10 minutes\n§  Take it out and let it cool down\n§  Blend the egg whites with the cream of tartar, pour the sugar gradually and mix until firm\n§  Place the meringue over the pie filling, seal it to the edges\n§  Bake for another 5-8 minutes or until the meringue is golden", "uuid": "56aa956f-942b-4683-aed0-1063448dbfc1"}, {"serving": "6", "description": "This dish is very popular and many Floridians can't wait for Summer because it means major scallop season. ", "preparing_time": "40", "ingredients": ["1/4 cup white wine", "1/4 cup white wine vinegar ", "1 tablespoon shallots ", "1/2 cup heavy cream 3/4 cup butter ", "24 sea scallops ", "1 tablespoon olive oil ", "salt and pepper to taste"], "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Scallops_with_wine_sauce.jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/8/8b/Scallops_with_wine_sauce.jpg", "description": "Scallops"}, "title": "Scallops with White Wine Sauce", "directions": "§  Prepare a medium skillet, pour white wine, white vinegar and add the chopped shallots\n§  Simmer until the liquid is reduced to roughly 1 tablespoon\n§  Add the heavy cream and cook until reduced by half\n§  Start adding the butter one tablespoon at a time, let it melt before adding another\n§  Preheat the oven on the broiler setting\n§  Sprinkle the scallops with olive oil, season with salt and pepper\n§  Broil them 3 minutes each side until the edges are light brown\n§  When serving, pour the sauce on the plate and add the scallops", "uuid": "52ce8f61-1be2-47c0-9e7e-063f2d136e27"}]}, {"country": "Georgia", "recipes": [{"serving": "4 to 6", "description": "Georgia is also known for its sweet Vidalia onions, which is among the Georgia's state symbols. So here is recipe for amazing Vidalia onion pie.", "preparing_time": "45", "ingredients": ["1 cup ritz cracker crumb", "4 tablespoons butter, melted", "2 cups vidalia onions, thinly sliced", "2 tablespoons butter", "2 eggs", "3⁄4 cup milk", "3⁄4 teaspoon salt", "1 dash pepper", "1⁄4 cup grated sharp cheddar cheese", "paprika"], "image": {"source_uri": "https://pixabay.com/cs/zwiebelkuchen-dort-kousek-cibule-ks-62479/", "uri": "https://pixabay.com/static/uploads/photo/2012/10/22/19/52/zwiebelkuchen-62479_640.jpg", "description": "Vidalia Onion Pie"}, "title": "Vidalia Onion Pie", "directions": "§  Preheat the oven to 350°F\n§  Prepare the Ritz crackers into a zip-lock bag, crumble them using a rolling pin\n§  Mix with melted butter\n§  Prepare a pie pan, press the dough to it properly\n§  On a skillet heat 2 tablespoons of butter and saute the onions until clear (not brown!)\n§  Spread the onions over the dough\n§  In a bowl mix eggs, milk, sprinkle with pepper and salt and pour over the onions\n§  Top the pie with cheese and paprika, bake for 30 minutes until hard at the center", "uuid": "ab8a85b9-5c7b-4b36-af2f-9e09d4083274"}, {"serving": "7 to 9", "description": "It is a popular traditional Georgia's dessert. Make it early in the day - the longer the peaches sit on the crust the better!", "preparing_time": "75", "ingredients": ["pastry for double-crust pie (your own or Pillsbury pie crusts)", "1⁄2 cup brown sugar", "1⁄2 cup white sugar", "1⁄4 cup cornstarch", "3⁄4 teaspoon ginger", "1⁄2 teaspoon cinnamon", "1 1⁄4 teaspoons vanilla", "5 peaches, peeled and sliced", "2 tablespoon lemon juice"], "image": {"source_uri": " https://commons.wikimedia.org/wiki/File:Mmm..._Mrs_Js_Famous_Peach_Pie_(5957460509).jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/e/e2/Mmm..._Mrs_Js_Famous_Peach_Pie_(5957460509).jpg", "description": "Georgia Peach Pie"}, "title": "Georgia Peach Pie", "directions": "§  Fold one refrigerated dough on a pie pan\n§  Preheat the oven to 450°F\n§  On a large pan saute sugars and cornstarch, season with ginger and vanilla\n§  Add the peaches into the mixture and let it thicken for approximately 5 minutes\n§  Let it cool and mix in the lemon juice\n§  Pour the peaches over the pie crust\n§  Cover with the second dough, seal properly at the edges, make small holes into the top dough\n§  Bake covered with foil for 15 minutes, then for another 45 minutes without the cover\n§  The pie is ready when it is bubbly and the edges are brown", "uuid": "4668af2e-affc-4464-9bc6-23e3114e00fb"}]}, {"country": "Hawaii", "recipes": [{"serving": "6 to 8", "description": "Laulau is a Native Hawaiian cuisine dish. It is a typical plate lunch dish and usually served with a side of rice and macaroni salad.", "preparing_time": "225", "ingredients": ["6 pounds taro leaves", "4 pounds pork butt, diced into 2-inch cubes", "3 tablespoons Hawaiian sea salt", "2 pounds salt cod or salmon, cut into 12 to 14 cubes", "30 ti leaves, middle ribs removed and reserved"], "image": {"source_uri": "https://www.flickr.com/photos/arndog/2199617935", "uri": "https://c1.staticflickr.com/3/2283/2199617935_a0f1204a34.jpg", "description": "Lau Lau"}, "title": "Lau Lau", "directions": "§  Prepare the taro leaves by cutting off the stems (be careful, do not make a hole in the leaf!)\n§  Keep the stems for later use\n§  Sort the leaves by size (every batch about 10 leaves)\n§  Chop the stems\n§  Sprinkle the pork with salt, put it in a large bowl, add the chopped stems and salt cod\n§  Put the mixture in the center of each leaf, wrap it like a present and then wrap again with a second leaf\n§  Secure each package with a kitchen thread\n§  Cook in a steamer or traditional imu until well done (about 3-4 hours)", "uuid": "abd34631-7535-4979-bf08-8d7538821fac"}, {"serving": "24", "description": "These delicious muffins are among the Hawaii's national dishes. They are wonderful with cup of tea or coffee.", "preparing_time": "40", "title": "Coconut Muffins", "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Chocolate_and_coconut_muffin.jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/1/11/Chocolate_and_coconut_muffin.jpg", "description": "Coconut Muffins"}, "ingredients": ["1⁄2cup butter", "1 1⁄4cups sugar", "2eggs", "1⁄2teaspoon vanilla", "1⁄2teaspoon salt", "2 1⁄2teaspoons baking powder", "1⁄2cup shredded unsweetened coconut", "2cups flour", "1(20 ounce) can pineapple"], "directions": "§  Mix flour, baking soda, coconut and salt\n§  Mix butter and sugar until smooth, then add eggs and vanilla, beat well\n§  Preheat the oven to 350°F\n§  Drain and then chop the pineapple (keep the juice)\n§  Prepare muffin pans and put paper cups in them\n§  Combine the flour mixture with the butter mixture, add the juice\n§  Place the pineapple to the paper cups and pour the dough over it, leaving the top third of the cup empty\n§  Bake for about 20-25 minutes\n§  Sprinkle with sugar, serve ", "uuid": "b03bcc33-7757-430f-a0fa-fa4e01f6481c"}]}, {"country": "Idaho", "recipes": [{"serving": "8", "description": "Potatoes are the top producing crop and they are among the Connecticut's edible state symbols.\n", "preparing_time": "120", "title": "Twice Baked Idaho Potatoes", "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:BakedPotatoWithButter.jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/9/93/BakedPotatoWithButter.jpg", "description": "Twice Baked Idaho Potatoes"}, "ingredients": ["4 large Idaho potatoes", "1 teaspoon olive oil (optional, for a softer-skinned potato)", "1/2 cup reduced-fat (\"light\") sour cream", "Pinch nutmeg", "Salt and freshly ground pepper to taste", "Milk (as desired, for consistency)"], "directions": "§  Preheat the oven to 400°F\n§  Make holes in the potatoes with a fork, sprinkle with olive oil\n§  Bake them for 50-60 minutes until they feel soft\n§  Take the pan out of the oven, slice the potatoes lengthwise in half and start scooping the inside while they are still hot\n§  Put the potato mash in a large bowl and press until smooth\n§  Make the potatoes into small bowls about ¼ inch thick\n§  Add sour cream and seasonings to the bowl with the potatoes, smooth with milk if necessary\n§  Preheat the oven to 325°F\n§  Start scooping the potato shells with the filling, then place them on a baking sheet\n§  Bake for 18-20 minutes\n§  Serve hot", "uuid": "1086da75-3ae9-492a-a391-929debd67c7b"}, {"serving": "4", "description": "They are typically served with French fries and a buttered piece of thick toast. They are commonly found in restaurants, bars, and fast-food joints in Southern Idaho.", "preparing_time": "160", "ingredients": ["1 pound boneless beef sirloin or cube steak (1/2-inch thick)", "2 cups buttermilk", "1 teaspoon Worcestershire sauce", "4 teaspoons kosher salt", "2 teaspoons freshly ground black pepper", "2 teaspoons granulated garlic", "2 teaspoons dry mustard", "2 teaspoons sweet paprika", "Vegetable oil, for frying", "2 cups all-purpose flour"], "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Lutong_Bahay_-_Chicken_Strips_with_%22Chinese%22_Sauce.jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/3/36/Lutong_Bahay_-_Chicken_Strips_with_%22Chinese%22_Sauce.jpg", "description": "Finger Steaks"}, "title": "Finger Steaks", "directions": "§  Carve the fat and the white pieces from the meat, chop it into strips with an approximate thickness of ½ inch wide and 2-3 inches long\n§  Prepare a large bowl and combine the buttermilk with worcherstire sauce, 2 tablespoons of salt and 1 tablespoons of dry mustard, pepper, granulated garlic and paprika\n§  Add the meat stripes and let them soak in the fridge for at least 2 hours\n§  In another bowl mix the flour with 2 tablespoons of salt and 1 tablespoon of pepper, paprika, dry mustard and granulated sugar\n§  Preheat 3 inches of oil in a dutch oven to 350°F\n§  Take the meat from the fridge, dredge each piece in the spicy flour, then in the buttermilk and then in the flour again\n§  Place the stripes carefully on the dutch oven, fry them in small batches for about 4 minutes until golden and crispy\n§  Place them on an absorptive paper\n§  Serve immediately with french fries and BBQ sauce", "uuid": "8661ab4e-f21c-4d65-8ba0-23731705266e"}]}, {"country": "Illinois", "recipes": [{"serving": "8", "description": "Chicago-style pizza refers to several different styles of pizza developed in Chicago. Arguably the most famous of these is the Deep Dish Pizza.", "preparing_time": "180", "title": "Deep Dish Pizza", "image": {"source_uri": "https://en.wikipedia.org/wiki/Chicago-style_pizza", "uri": "https://upload.wikimedia.org/wikipedia/commons/4/4b/Giordano's_Deep_Dish_Pizza.jpg", "description": "Deep Dish Pizza"}, "ingredients": ["1⁄4 ounce active dry yeast (2 1/4 tsps)", "1 1⁄4 cups lukewarm water", "1 teaspoon sugar", "3 1⁄4 cups unbleached bread flour, plus more for dusting", "1⁄2 cup medium-grind yellow cornmeal", "1 teaspoon table salt or 1 1⁄2 teaspoons kosher salt", "1⁄2 cup olive oil, plus", "more olive oil, for oiling bowl and pan"], "directions": "§  Put yeast in a large bowl and dissolve in ¼ cup of warm water\n§  Sprinkle with sugar, add ¼ cup of flour and combine\n§  Let it rest in a warm place, covered, for about 20 minutes\n§  After 20 minutes add the remaining 3 cups of flour, salt, cornmeal, 1 cup of warm water and ½ cup of olive oil\n§  Mix the dough with as much flour as possible\n§  Put the dough on a floured surface and knead until smooth and elastic (10-12 minutes) until no longer sticky\n§  Take a large bowl and grease it with olive oil, cover the dough in oil on all sides\n§  Cover the bowl with plastic wrap, put a damp kitchen towel over it\n§  Put in a warm place and let it leaven for 1 hour and 30 minutes to 2 hours (the dough should be twice its' size)\n§  Knead once again for 3-4 minutes, then place it on an oiled deep dish pizza pan\n§  Once the dough rises in the pan (15-20 minutes), press the dough until it is 2 inches on the sides and it is evenly spread at the bottom of the pan\n§  Continue with any deep dish pizza recipe", "uuid": "057a6c48-8bf4-4146-b4b2-e379d239f70c"}, {"serving": "4", "description": "A Chicago-style hot dog, also known  as the Chicago Dog or Chicago Red Hot is an all-beef frankfurter on a poppy seed bun, originating from the city of Chicago, Illinois.", "preparing_time": "25", "ingredients": ["4 natural casing beef frankfurters", "4 hot dog buns (with poppyseeds if you can find them)", "1 small onion, diced fine", "3 -4 teaspoons sweet pickle relish (bright green type if you can find it!)", "1 cold-pack kosher dill pickle, quartered lengthwise", "1 small tomatoes, sliced into julienne strips", "4 -8 pickled sport bell peppers or 4 -8 tiny hot peppers (Kroger sells these)", "dusseldorf-style brown mustard, with horseradish,to taste (may use yellow mustard)", "celery seed", "poppy seed (omit if using seeded buns)", "beer, for simmering (standard golden lager preferred; not authentic)"], "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Chicago_style_hot_dogs_(13340033944).jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/f/f0/Chicago_style_hot_dogs_(13340033944).jpg", "description": "Chicago-Style Hot Dogs"}, "title": "Chicago-Style Hot Dogs", "directions": "§  Cook the Frankfurt sausages in water (or beer) for 10 minutes\n§  Put the hot dog buns in the microwave (follow the instructions on the bag)\n§  Take the sausage and place it into the bun, pour mustard over it\n§  Garnish with dill spear, relish, tomato, onion and 1-2 sport peppers\n§  Sprinkle with poppy seeds, decorate with celery\n§  Serve right awa", "uuid": "f9e7297e-68d6-4bd9-b75f-7684b8ccba95"}]}, {"country": "Indiana", "recipes": [{"serving": "6", "description": "The Indiana State Fair is known for its tasty fried treats! Deep-fried sauerkraut balls are a favorite.", "preparing_time": "105", "ingredients": ["8 ounces sausage, crumbled or 8 ounces beer, n' brat suasage", "1⁄4 cup finely chopped onion", "1 (14 ounce) can sauerkraut (squeeze dry and snip fine)", "2 teaspoons breadcrumbs", "1 (3 ounce) package cream cheese (can use low fat kind)", "2 teaspoons parsley", "1 teaspoon prepared mustard", "garlic salt", "1⁄4 teaspoon pepper", "1⁄4 cup flour", "2 beaten eggs", "1⁄4 cup milk", "1 cup breadcrumbs"], "image": {"source_uri": "https://en.wikipedia.org/wiki/Arancini", "uri": "https://upload.wikimedia.org/wikipedia/commons/e/ee/Arancini_002.jpg", "description": "Sauerkraut Balls"}, "title": "Sauerkraut Balls", "directions": "§  On a pan saute the sausage and onions until golden\n§  Drain the fat and place into a large bowl\n§  Add sauerkraut and 2 tablespoons of breadcrumbs to the bowl, mix in with cream cheese, garlic salt, pepper and mustard, sprinkle with parsley\n§  Combine all the ingredients and let it cool in a fridge for 1 hour\n§  In the meantime whisk eggs with milk and pour it into one deep plate, prepare a second plate and fill it with breadcrumbs\n§  Take out the bowl and start making small meat balls, coat them with flour\n§  Coat the balls first in the egg-milk, then cover them with breadcrumbs\n§  You can finish your meatballs either in a deep fryer until golden or in an oven (15-20 minutes at 375°F)\n§  Serve hot", "uuid": "4966db8f-5a9a-4dc9-95d3-0391eaf39a4d"}, {"serving": "8", "description": "This sugar cream pie is for sheer Indiana dessert perfection. It enrich every holiday dinner.", "preparing_time": "150", "ingredients": ["Half recipe of flaky butter pie dough", "1 cup sugar", "1⁄2 cup all-purpose flour", "1 cup half-and-half", "1 cup heavy cream", "1 tsp. vanilla extract", "Freshly grated nutmeg, to garnish"], "image": {"source_uri": "https://en.wikipedia.org/wiki/Sugar_pie", "uri": "https://upload.wikimedia.org/wikipedia/commons/d/da/Sugar_Cream_Pie.jpg", "description": "Hoosier Pie"}, "title": "Hoosier Pie", "directions": "§  Prepare a refrigerated dough on a dry floured surface\n§  Roll it to 12 inch circle and place it to a 9 inch pie pan, decorate the sides with a fork\n§  Let cool for 30 minutes\n§  Preheat the oven to 375°F\n§  Place a baking sheet on the pie crust and weigh it with beans (you can reuse them later)\n§  Bake for approximately 15 minutes (until the edges are golden)\n§  Take it out of the oven, let chill, remove the paper with beans\n§  Prepare a bowl and combine the sugar with flour, then slowly stir in the cream and vanilla\n§  Pour the mixture over the crust and let it bake for 1 hour and 30 minutes until set\n§  Let it cool down to room temperature, sprinkle with grated nutmeg before serving", "uuid": "01b61b4f-493d-4d9e-9a62-efe6e46270bf"}]}, {"country": "Iowa", "recipes": [{"serving": "6 to 8", "description": "This delicious snack is popular at food fairs and carnivals and it loved by people across the America.", "preparing_time": "25", "ingredients": ["3⁄4 cup yellow cornmeal", "3⁄4 cup flour", "1 teaspoon baking powder", "1⁄4 teaspoon salt", "1 egg, beaten", "2⁄3 cup milk", "6 -8 small wooden sticks", "6 -8 hot dogs", "oil, for deep-fat frying"], "image": {"source_uri": "https://www.flickr.com/photos/benstephenson/20802330", "uri": "https://c1.staticflickr.com/1/16/20802330_c99290d7b2.jpg", "description": "Corn Dogs"}, "title": "Corn Dogs", "directions": "§  Heat the oil in the deep fryer to 375°F\n§  In a blender combine baking powder, cornmeal, flour, salt and egg, mix well\n§  Add milk for better thickness, pour into a long glass and let it stand for a few minutes\n§  Dry the hot dogs, coat with flour\n§  Pierce the hot dogs with sticks\n§  Start soaking them in the batter, let the excess drip off\n§  Fry one by one about 5-6 minutes until nutty brown\n§  Drain on paper towels, serve hot\n", "uuid": "25d1d8be-4b5f-401c-bebf-1b82c15b551e"}, {"serving": "3 to 4", "description": "The main culinary traditions in Iowa are heavily influenced by the European food culture. This popular soup is considered to be a main dish rather than a starter.", "preparing_time": "25", "ingredients": ["9 pig's tails, washed and cleaned", "chicken or vegetable stock, or ham cooking water or water, enough to cover", "1 onion, chopped", "3 large carrots, chopped", "2 sticks celery, chopped", "3 cloves garlic, crushed", "1 leek, chopped", "1 small swede, chopped", "1 large turnip, chopped", "2 bay leaves", "1/2 tsp mustard seeds", "1/4 tsp coarsely crushed black peppercorns", "4 large potatoes, peeled and chopped"], "image": {"source_uri": "https://www.flickr.com/photos/9439733@N02/2088701805", "uri": "https://c1.staticflickr.com/3/2406/2088701805_8f43c1a067.jpg", "description": "Pig Tail Soup"}, "title": "Pig Tail Soup", "directions": "§  Put the tails in a large pan and add water\n§  Bring to a boil, catch all the waste that is stocking on the surface\n§  Add all the veggies and seasonings\n§  Bring to a boil again, then reduce the heat and let it cook for 40 minutes until all the ingredients are soft\n§  Put in the potatoes and simmer for another 15 minutes, add the dill and about 150 ml of gherkins pickling juice\n§  Serve with pickles and rye bread", "uuid": "709a59b1-34c2-4c3a-99f0-b28a2a1a283d"}]}, {"country": "Kansas", "recipes": [{"serving": "6 to 8", "description": "Kansas City-style barbecue refers to the specific regional barbecue style of slowly smoked meat that evolved from the pit of Henry Perry in the early 1900s in Kansas City, Missouri.", "preparing_time": "210", "ingredients": ["#Rub:", "3 tablespoons sweet paprika", "4 teaspoons kosher salt", "3 teaspoons light brown sugar", "2 teaspoons garlic powder", "2 teaspoons onion powder", "2 teaspoons freshly ground black pepper", "1 1/2 teaspoons dry mustard", "1/2 teaspoon cayenne", "2 racks St. Louis-cut pork ribs (about 4 1/2 pounds)", "#BBQ Sauce:", "2 tablespoons vegetable oil", "6 cloves garlic, smashed and roughly chopped", "2 tablespoons tomato paste", "1 slightly heaping tablespoon chili powder", "1 tablespoon paprika", "1 teaspoon crushed red pepper", "1/4 teaspoon ground allspice", "Pinch ground cloves", "2 cups ketchup", "1/2 cup cider vinegar", "1/4 cup dark molasses", "1/4 cup firmly packed dark brown sugar", "1 tablespoon kosher salt", "1 tablespoon soy sauce", "1 tablespoon Worcestershire sauce", "2 teaspoons dry mustard", "1 teaspoon freshly ground black pepper", "1 bay leaf"], "image": {"source_uri": "https://en.wikipedia.org/wiki/Pork_ribs", "uri": "https://upload.wikimedia.org/wikipedia/commons/c/cb/CountryStyleRibs.JPG", "description": "Kansas City-Style Ribs"}, "title": "Kansas City-Style Ribs", "directions": "§  #Rub – combine the paprika, sugar, salt, black pepper, onion, garlic powder and cayenne pepper\n§  Preheat the oven to 275°F\n§  Peel off the hard membrane that covers the bony side of the ribs\n§  Brush the ribs with the rub from both sides\n§  Place them in the oven on a baking sheet, bone side up, cover with a foil and bake covered\n§  Bake until tender, for about 1 hour to 1 hour and a half\n§  #BBQ Sauce – on heated oil saute the garlic, add tomato paste, paprika, red pepper, allspice, cloves and chilli powder\n§  Cook for approximately 3 minutes until dark red, then add 2 cups of water, ketchup, soy sauce, worcherstire sauce, black pepper, salt, mustard, bay leaf, vinegar, molasses and brown sugar\n§  Reduce the heat and cook for 30 minutes\n§  Remove the bay leaf before serving\n§  Take 1 ½ cup of the sauce, use it as a dip, the rest of the sauce use as the glaze for the ribs\n§  After 1 ½ hours of baking, uncover the foil and glaze with BBQ Sauce, bake uncovered until the meat comes off the bone easily (about another 1 ½ hours)\n§  Rotate and glaze the ribs every 30 minutes\n§  Serve with barbecue sauce as a dip", "uuid": "2d09b883-1993-4e5d-8b50-378cfc0bc709"}, {"serving": "4", "description": "This recipe is a great way to spice up an ordinary hamburger. Kansans love their barbecues and you will be close to the true food spirit of the land with this original Kansas' burger.", "preparing_time": "45", "ingredients": ["1 lbground beef (lean)", "2 Tketchup", "2 TWorcestershire sauce", "1⁄2 tsalt", "1 pnpepper", "2 Tmargarine", "1 cmushrooms (fresh musrooms, washed and sliced)", "3⁄4 cSwiss cheese (shredded)", "4  hamburger rolls (split)"], "image": {"source_uri": "https://pixabay.com/cs/photos/bacon/", "uri": "https://pixabay.com/static/uploads/photo/2015/04/20/13/25/burger-731298_640.jpg", "description": "Kansas Grilled Cheeseburger with Mushrooms"}, "title": "Kansas Grilled Cheeseburger with Mushrooms", "directions": "§  #Patties – put the grounded meet in a large bowl, spice with ketchup, worcherstire sauce and salt, stir properly\n§  Make patties depending on the size of the burger bun, approximately 1 inch thick\n§  Grill the patties for 8 minutes from each side (the meat can not be pink)\n§  When cooked, let it sit for 10 minutes\n§  Heat the oil in the skillet and fry the mushrooms for about 6 minutes until soft\n§  #Assembling the burger – start with the bottom roll, add the patty, sprinkle with the grated cheese and mushrooms, cover with the top roll and grill it upside down\n§  When the cheese starts to melt, remove from the grill and serve", "uuid": "28090200-1cbb-425a-8b5c-7ee42d403853"}]}, {"country": "Kentucky", "recipes": [{"serving": "4", "description": "Kentucky Hot Brown (also known as a Hot Brown Sandwich) is an American hot sandwich originally created at the Brown Hotel in Louisville, Kentucky, by Fred Schmidt in 1926. It was created to serve as an alternative to ham and egg late-night suppers.", "preparing_time": "105", "title": "Kentucky Hot Brown", "image": {"source_uri": "https://en.wikipedia.org/wiki/Hot_Brown", "uri": "https://upload.wikimedia.org/wikipedia/commons/d/db/Hot_Brown_Kurtz.jpg", "description": "Kentucky Hot Browns"}, "ingredients": ["#For the turkey:", "1 turkey breast, about 4 to 5 pounds", "4 tablespoons unsalted soft butter", "Salt and freshly ground black pepper", "#For the sauce:", "2 tablespoons unsalted butter", "2 tablespoons all-purpose flour", "2 1/2 cups whole milk", "2 cups grated sharp white Cheddar", "1/4 cup grated Parmesan", "Pinch freshly ground nutmeg", "Salt and freshly ground black pepper", "#For the egg bread:", "4 large eggs", "1/4 cup milk", "Salt", "8 (1/2-inch) thick slices good day old white bread (recommended: Pullman or Pain de mie)", "4 tablespoons butter", "4 tablespoons vegetable oil", "#For the egg bread:", "4 large eggs", "1/4 cup milk", "Salt", "8 (1/2-inch) thick slices good day old white bread (recommended: Pullman or Pain de mie)", "4 tablespoons butter", "4 tablespoons vegetable oil", "#For assembly:", "Egg battered bread", "Roasted turkey breast, sliced into 1/4-inch thick slices", "3 ripe beefsteak tomatoes, cut into 1/2-inch thick slices and griddled until slightly charred and just cooked through", "1 1/2 cups grated sharp white Cheddar", "1/2 cup freshly grated Parmesan", "16 thick slices slab bacon, cooked until crisp", "Finely chopped fresh chives", "Finely chopped fresh flat-leaf parsley"], "directions": "§  #Sauce – In a medium skillet melt butter and add flour, cook for 1 minute\n§  Pour in the milk and bring to a boil, whisking constantly, about 4-5 minutes until it thickens\n§  Add cheese, nutmeg, salt and pepper, remove from the heat if the cheese has melted\n§  #Egg bread – whisk eggs and milk, season with salt and let the bread soak in it\n§  Heat the butter and the oil in a large saucepan and fry the bread 4 pieces at a time until light brown from both sides, let them drain on an absorptive paper\n§  #Turkey – preheat the oven to 325°F\n§  Cover the turkey with butter, sprinkle with salt and pepper\n§  Roast in the oven for 15 minutes\n§  After 15 minutes, reduce the heat to 350°F and bake until the thermometer shows 155°F in the center registers (about 1 hour and 30 minutes)\n§  Take it out of the oven, cover loosely with tinfoil before slicing and serving\n§  #Assembling – warm the egg bread from both sides using a broiler, for about 20 seconds\n§  Put 2 or 3 slices of turkey and 2 slices of tomato on the top of each bread, pour the sauce over it\n§  Place the cheddar cheese on one slice, the Parmesan on the other and broil until bubbly and golden\n§  Decorate the browns with 2 slices of bacon and sprinkle parsley and chives over the top", "uuid": "90e62c7e-9771-4b79-9b07-12e4c5381132"}, {"serving": "10", "description": "Burgoo is a spicy stew, similar to Irish or Mulligan stew, often served with cornbread or corn muffins. Burgoo making in Kentucky often serves as a social event, in which each attendee brings one or more ingredients.", "preparing_time": "100", "ingredients": ["2 smoked bacon slices, chopped", "6 ounces bulk sweet Italian pork sausage", "8 ounces chuck roast, cut into 1-inch pieces", "3/4 cup chopped onion ", "1/2 cup chopped carrot ", "1/4 cup chopped celery ", "2 chicken thighs, skinned and cut into bite-sized pieces", "1 teaspoon kosher salt", "1/2 teaspoon freshly ground black pepper", "5 garlic cloves, minced", "1/2 cup dry white wine ", "3 cups unsalted chicken cooking stock", "3 cups water ", "1 cup uncooked brown rice", "8 ounces small red potatoes, quartered", "1 1/2 cups (1-inch) fresh green bean pieces", "1 cup fresh or frozen corn kernels, thawed", "Hot sauce (optional)"], "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Hungarian_Guly%C3%A1s.jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/7/75/Hungarian_Guly%C3%A1s.jpg", "description": "Kentucky Burgoo"}, "title": "Kentucky Burgoo", "directions": "§  Prepare a dutch oven and stir fry the bacon on a medium low heat for 3 minutes, add the sausage and cook for 4 minutes or until golden, add beef and saute for 3 minutes\n§  Add carrot, onion and celery, stir occasionally (cook for 5 minutes), then add chicken, salt and pepper (cook for 4 minutes), add garlic and quickly fry it – be careful, can't turn brown! (1 minute)\n§  Pour vine, bring to a boil, let the liquid reduce by half (3 minutes), then add water and rice\n§  Bring to a boil again, then reduce the heat\n§  Cover with a lid and cook for 30 minutes\n§  Add the potatoes, simmer for 20 minutes\n§  Add the green beans and corn, cook for 8 minutes\n§  Add chilli powder or sauce if desired, serve hot", "uuid": "663a8635-68d8-47ab-854e-fa667de6424b"}]}, {"country": "Louisiana", "recipes": [{"serving": "8 to 10", "description": "Gumbo originated in southern Louisiana in 18th century and it’s a soup or stew. Gumbo is a reminder of the mix of cultures which live in southern Louisiana. This food combines the cuisine of Spanish, Africans, indigenous tribes, French, Italians and Germans.", "preparing_time": "160", "title": "Gumbo", "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Mmm..._chicken_gumbo_with_Andouille_and_tasso_(6751505711).jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Mmm..._chicken_gumbo_with_Andouille_and_tasso_(6751505711).jpg", "description": "Gumbo"}, "ingredients": ["3 boneless skineless chicken breast halves", "leaf parsley, coarsely chopped, chopped leaves for garnish", "salt and pepper", "3 stalks celery, chopped", "¼ cup vegetable oil", "¼ cup Worcestershier sauce", "1 pound smoked sausage", "4 cups hot water", "½ cup all-purpose flour", "5 beef bouillon cubes", "5 tablespoons margarine", "1 stewed tomatoes with juice", "1 large onion, chopped", "2 cups frozen sliced okra", "8 cloves garlic minced", "4 green onions, sliced", "1 green bell pepper, seeded, chopped", "½ pound small shrimp, peeled, deveined and cooked"], "directions": "Heat the oil in a heavy bottomed Dutch oven over medium-high heat.\nAdd the seasoned chicken and fry on both sides until browned.\nTake out the chicken, add the sausage, saute until light brown, then take it out.\nStrew ½ cup of flour onto the oil in the pan, add some margarine and fry over medium heat until the roux is brown and let the mixture cool to room temperature.\nReturn the pan to low medium heat, add 3 tablespoons of margarine and all the veggies and fry for about 10 minutes.\nAdd spices (parsley if you like), stir occasionally, cook for 10 minutes\nAdd 4 cups of water and bouillon cubes, then the chicken and the sausage, stir constantly and bring to a boil.\nReduce the heat, cover with a lid and brew for 45 minutes. When all the ingredients are soft, add tomatoes and okra, cover it again and cook for another hour.\nBefore serving decorate with the green onions, shrimps and chopped parsley, serve with rice.", "uuid": "db8bf3c4-96ad-4a0e-8f58-1ea690469a4f"}, {"serving": "15 pies", "description": "The Natchitoches Meat Pie is a regional food from northern Louisiana. It belong to official state foods of Louisiana. This popular recipe is over 300 years old.", "preparing_time": "85", "ingredients": ["1 tablespoon vegetable oil", "1 teaspoon Cajun seasoning", "1 tablespoon all-purpose flour", "1 pinch garlic powder", "1 onion, chopped", "1 (15 ounce) package store-bought refrigerated pie dough, at room temperature", "1 pound pork sausage", "1 pound ground beef", "1 quart vegetable oil for deep frying"], "image": {"source_uri": "https://en.wikipedia.org/wiki/Natchitoches_meat_pie", "uri": "https://upload.wikimedia.org/wikipedia/commons/2/23/Natchitoches-meatpies-and-beans-rice.jpg", "description": "Natchitoches Meat Pies"}, "title": "Natchitoches Meat Pies", "directions": "Prepare a large saute pan, pour 1 tablespoon of vegetable oil and heat on medium – low heat.\nAdd flour, stir fry until it turns light brown (about 2-3 minutes).\nAdd a finely chopped onion and fry until soft (about 5 minutes). Crumble in the meat and cook for 15 minutes.\nMix in the spices. Pour fat out of the pan and cool to room temperature\nPlace the dough on a floured surface. Roll to an approximate thickness of about ¼ inch. Make a small round, then put the mixture in the center of each one.\nFold over the centers of the filled rounds and press the edges with a fork. Do that with all the pies.\nYou can finish your pies in a deep fryer or in an oven.\n#For deep frying – preheat the oil to 190 degrees C. Start frying the pies, about 3 pieces a batch. The pie is ready when the dough has a golden brown colour (about 3-4 minutes). Place on paper towels to drain the fat.\n#For baking in the oven – preheat the oven to 175 degrees C, place the pies on a baking sheet and bake for about 15 to 20 minutes.", "uuid": "1a40fd7a-87b5-4df8-b97f-36059b7afa93"}]}, {"country": "Maine", "recipes": [{"serving": "4", "description": "It’s the street food of the rocky Maine coast. The lobster meat in the warm roll is usually served cold, rather than warm or hot.", "preparing_time": "120", "title": "Lobster Roll", "image": {"source_uri": "https://en.wikipedia.org/wiki/Lobster_roll", "uri": "https://upload.wikimedia.org/wikipedia/commons/e/ec/McLobster.jpg", "description": "Lobster Roll"}, "ingredients": ["Four 1- to 1 1/4-pound lobsters", "1/4 cup plus 2 tablespoons mayonnaise", "Salt and freshly ground pepper", "1/4 cup finely diced celery", "2 tablespoons fresh lemon juice", "Pinch of cayenne pepper", "4 top-split hot dog buns", "2 tablespoons unsalted butter, melted", "1/2 cup shredded Boston lettuce"], "directions": "§  Prepare a large pan with salted water, bring to a boil\n§  Prepare a large bowl with ice water\n§  Cook the lobster for 10 minutes until red, then place it quickly in the ice and let it cool for 2 minutes\n§  Drain the lobster\n§  Remove the meat and cut it to approximately ½ inch thin pieces, dry, wash in a strainer and then let it cool down for about an hour\n§  Mix the lobster meat with mayonnaise, sprinkle with salt and pepper, add chopped celery, cayenne pepper and lemon juice and blend properly\n§  Heat oil on a large pan, coat hotdog buns with the butter and let it turn golden on both sides\n§  Fill each hotdog bun with shredded lettuce and the lobster mixture, serve immediately", "uuid": "ba796849-addd-4002-8775-eed1ca207464"}, {"serving": "8", "description": "This delicious pie is among the Maine's state dish. Blueberry Pies are often eaten in the summertime because it is blueberries season.", "preparing_time": "75", "ingredients": ["#Crust:", "One double recipe for butter pie crust dough", "#Filling:", "6 cups (about 2 1/4 pounds or 1 kilo) of fresh (or frozen) blueberries, rinsed and stems removed (if using frozen, defrost and drain first)", "1 teaspoon lemon zest", "1 Tbsp lemon juice", "1/4 cup (about 30g) all-purpose flour or quick cooking \"minute\" tapioca (for thickening)", "1/2 cup white granulated sugar (100g)", "1/2 teaspoon cinnamon", "2 Tbsp butter (unsalted), cut into small pieces", "#Egg wash ingredients:", "1 egg", "1 tablespoon milk"], "image": {"source_uri": "https://en.wikipedia.org/wiki/Blueberry_pie", "uri": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Best_Blueberry_Pie_with_Foolproof_Pie_Dough.jpg", "description": "Bluberry Pie"}, "title": "Bluberry Pie", "directions": "§  #Crust – place the refrigerated dough on a dry floured surface, roll to a circle about 13 inches wide in diameter\n§  Place in a pie pan, leave ½ inch overlap\n§  Cool in the fridge\n§  Stir the blueberries with sugar, flour or tapioca, lemon zest, lemon Juice and cinnamon, coat every blueberry in the sugary mixture\n§  Take the pie pan from the fridge, spread seasoned blueberries on it, add little sticks of butter\n§  Preheat the oven to 325°F\n§  Take the second dough, prepare like the first and place it on the filling, seal it properly with your fingers\n§  Put the pie in the fridge again\n§  #Egg wash – whisk milk and eggs, brush on the top of the pie\n§  Pierce the dough with a fork a few times\n§  Place the pie on a middle rack, put tinfoil under the pan in order to prevent spilling\n§  Bake for 20 minutes at 425°F, then reduce the heat to 325°F and bake for another 30-40 minutes\n§  Let it cool completely before serving", "uuid": "34e1678f-f0bb-4594-b3eb-0223dfee496f"}]}, {"country": "Maryland", "recipes": [{"serving": "4", "description": "Blue Crabs is among the Maryland's official state symbols. Steamed Blue Crabs are popular for cold beer to be thrown on the crabs during the steaming process.", "preparing_time": "35", "title": "Steamed Blue Crabs", "image": {"source_uri": "http://bestandworstever.blogspot.cz/2012/06/worst-thing-to-eat-when-you-don-know.html", "uri": "http://2.bp.blogspot.com/-ckep4olSl5s/T-XLwN4w5JI/AAAAAAAAEhg/xwvK7YsDRx4/s1600/Blue-crab.jpg", "description": "Steamed Blue Crabs"}, "ingredients": ["One 12-ounce bottle lager-style beer", "1 cup cider vinegar", "1/2 cup seafood seasoning, such as Old Bay", "1 dozen live blue crabs, preferably males (\"Jimmies\")", "1 tablespoon kosher salt"], "directions": "§  Prepare a large pot, add 1 ½ cup of water, lager, vinegar and 2 tablespoons of the seafood spice, stir well, pour into the steamer\n§  Place the crabs in the steamer, about 2-3 layers above the liquid\n§  Sprinkle every layer of the meat with salt and the seafood seasoning\n§  Cover with a lid and let it steam for 30 minutes (the crab should be light red colour, not green or blue!)", "uuid": "f023427f-6b73-4881-a500-79ba6b331d2d"}, {"serving": "12", "description": "This delicious cake si among the Maryland's national dishes. Smith Island Cake is baked for any occasion and not reserved only for holidays. The cake is also baked as the feature prize for a local fundraising tradition called a cake walk.", "preparing_time": "125", "title": "Smith Island Cake", "image": {"source_uri": "https://en.wikipedia.org/wiki/Smith_Island,_Maryland", "uri": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Smith_island_cake2009.jpg", "description": "Smith Island Cake"}, "ingredients": ["#Cake:", "24 tbsp. unsalted butter, melted, plus more for pans", "3 1⁄2 cups flour, plus more for pans", "4 tsp. baking powder", "1 1⁄2 tsp. kosher salt", "2 1⁄4 cups sugar", "2 cups milk", "1 tbsp. vanilla extract", "6 eggs", "#Icing:", "2 oz. unsweetened chocolate, chopped", "2 oz. semisweet chocolate, chopped", "2 cups sugar", "1 cup evaporated milk", "6 tbsp. unsalted butter, melted", "2 tsp. vanilla extract"], "directions": "§  #Dough – grease and flour four 9-inch wide pie pans, set aside\n§  In a large bowl combine flour, baking powder and salt\n§  In another bowl whisk sugar, butter, vanilla and milk\n§  Add the liquid ingredients to the dry ones, mix until well combined\n§  Let it sit for 15 minutes, then whisk again until completely smooth\n§  Pour half of the batter to the 4 prepared pans, cover only the bottom\n§  Bake the cakes, rotating them in the process, about 15 minutes until brown\n§  Take the cakes out of the oven, let them cool in the pans, then remove and let cool on a wire rack\n§  Let the pans cool, then grease and flour them again and bake the remaining batter\n§  #The icing – in a large pot bring chocolate, milk, sugar and butter to a boil, cook until the mixture is smooth (about 8 minutes)\n§  Let it cool, stir in vanilla, when the mixture is cool enough to spread, start brushing it on each layer on the cake but one (leave the top one without the icing)\n§  Chill for about 30 minutes to let the layers of the cake sit\n§  Warm the remaining icing if necessary and glaze over the sides and the top\nServe cold", "uuid": "81683cfb-d531-4ce6-b1e7-c09f192b8f4a"}]}, {"country": "Massachusetts", "recipes": [{"serving": "10", "description": "This delicious pie is among the Massachusetts' state dish. It is a wonderful combination of cake, custard and chocolate glaze.", "preparing_time": "170", "ingredients": ["2 tablespoons unsalted butter, plus more for pan", "1 1/4 cups sugar, plus more for pan", "1 1/4 cups sifted cake flour (not self-rising)", "1 1/4 teaspoons baking powder", "3/4 teaspoon salt", "2 large eggs", "2 large egg yolks", "3/4 cup whole milk", "2 teaspoons pure vanilla extract", "7 tablespoons heavy cream", "3 ounces best-quality semisweet chocolate, coarsely chopped", "Pastry cream filling"], "image": {"source_uri": "https://www.flickr.com/photos/ecastro/8306141016", "uri": "https://c1.staticflickr.com/9/8078/8306141016_8532e5981a.jpg", "description": "Boston Cream Pie"}, "title": "Boston Cream Pie", "directions": "Butter a 9 by 2 inch round cake pan, line with parchment paper\nButter parchment, sprinkle with sugar\nIn a bowl whisk flour, baking powder and salt\nUse an electric mixer to whisk eggs and egg yolks for 1 minute (on medium speed)\nKeep adding sugar and beat until light and fluffy (about 3 minutes)\nIn the meantime heat milk and butter in a small saucepan until hot over medium heat, do not boil the milk, remove from heat and stir in vanilla\nWhile mixing carefully add hot milk to the mixture, slowly add flour mixture, ¼ cup at a time, mix until combined, move it to the prepared pancakes\nBake until the cake is done (about 40 minutes, should be golden brown, you can use a tester)\nRemove from the pan, let cool completely\n#Glaze – bring heavy cream to a boil in a small saucepan, put chocolate in another bowl and pour the cream over it and stir until combined, let cool for about 10 minutes\nAssembly of the cake – get the pastry cream, beat until smooth\nCut the cake in half, spread the bottom half with the filling, top with remaining layering\nSpread the glaze over the center of the cake\nChill for 20 minutes, serve", "uuid": "00bf1522-1de4-42c0-877b-12f3494b1478"}, {"serving": "4 to 6", "description": "Clam chowder is often served in restaurants on Fridays in order to provide a seafood option for those who abstain from meat every Friday. It is particularly popular during \"clamming\" season when clams are in abundance and it is legal to dig your own. ", "preparing_time": "60", "ingredients": ["2 cups russet potatoes (peeled and cubed 1/2\" x 1/2\" pieces)", "1⁄2 cup butter", "2 tablespoons diced green onions (bulb only)", "1⁄4 cup flour", "2 (6 1/2 ounce) cans minced clams (with juice)", "1 teaspoon salt (or to taste)", "16 ounces half-and-half", "1⁄2 cup whole milk", "1⁄3 cup clam juice", "fresh parsley (minced for garnish)"], "image": {"source_uri": "https://www.flickr.com/photos/pointnshoot/677657245", "uri": "https://c2.staticflickr.com/2/1086/677657245_6b7d2597b2.jpg", "description": "Clam Chowder"}, "title": "Clam Chowder", "directions": "Cook the potatoes in a large pot until soft\nturn off heat, drain the water\nMelt the butter on a 2 quart skillet, stir the onions and cook until transparent\nSprinkle the butter with flour and saute quickly, wait until it thickens\nAdd half and half a little at a time, stir (it should have a creamy consistency)\nAdd the clams with juice, potatoes, salt, bottled clam juice, pour in the milk\nBring to a slow boil on medium low heat\nReduce the heat to low and simmer for 15 minutes, stir frequently", "uuid": "81f48d67-ee9b-4266-be3b-6119a40a45e5"}]}, {"country": "Michigan", "recipes": [{"serving": "5 Pasties", "description": "The pasty is popular world-wide and variations can be found in the United States, Australia, Argentina, Mexico and elsewhere.", "preparing_time": "85", "ingredients": ["1 kg shortcrust pastry, 5 sheets", "#Filling:", "300 g ground beef", "3 medium potatoes, peeled and cut into tiny (pea sized)", "1 medium carrot, peeled and grated", "1 small swede, peeled and grated", "1 medium onion, very finely diced", "2 tablespoons peas", "2 teaspoons beef stock powder", "2 tablespoons water", "black pepper, lots of black pepper", "#Glaze:", "1 egg, lightly beaten with", "2 tablespoons milk"], "image": {"source_uri": "https://en.wikipedia.org/wiki/Pasty", "uri": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Cornish_pasty.jpeg", "description": "Michigan Pasties"}, "title": "Michigan Pasties", "directions": "Preheat the oven to 350°F\nPut the refrigerated dough on a floured surface, cut circles from it using a small round plate\nMix all the ingredients for filling, stir properly until all the ingredients are combined\nDivide the mixture into 5 batches\nPut the meat on the center of each pastry, water the edges of the dough and fold, making a moon shape, seal carefully with a fork or fingers\nPlace all the pies on a greased baking sheet, make holes in each of them to let the steam out\nGlaze them and bake for 45 minutes until light brown color", "uuid": "77ebca07-1f09-4152-b570-98adf2ae3417"}, {"serving": "8", "description": "Michigan is famous for its cherry festival. And cherry is also the Michigan's national fruit. So here is recipe for amazing cherry pie.", "preparing_time": "70", "ingredients": ["#Crust:", "Pastry for 9\" double crust pie", "4 drops almond extract", "#Filling:", "5 or more c. frozen dry pack pitted red tart cherries", "1 c. reserved cherry juice", "1 c. sugar", "2 tbsp. + 1 1/2 tsp. cornstarch", "1/8 tsp. salt", "1 tbsp. butter", "1/8 tsp. almond extract", "4 drops red food coloring"], "image": {"source_uri": "https://www.flickr.com/photos/aloha75/5953100136", "uri": "https://c1.staticflickr.com/7/6138/5953100136_94cd1eef63_b.jpg", "description": "Michigan Cherry Pie"}, "title": "Michigan Cherry Pie", "directions": "#Crust – pour 4 drops of almond extract to water\nLine the refrigerated dough onto the pie plate (leave the exceeding dough)\nPreheat the oven to 425°F\n#Filling – Let the cherries thaw in a large strainer (keep the bowl under it to keep the juice), take 4 cups of fruit and 1 cup of cherry juice \nOn a medium saucepan heat cornstarch, salt and sugar, gradually adding the reserved juice, until fine and clear\nAdd 1/8 teaspoon of almond extract, butter and the food color, let cool and toss in the cherries\nSpread the filling onto the pie crust and decorate with the woman lattice top, seal the edges properly, cover the edge with a foil\nBake for 30 minutes, remove the foil and bake for another 10 minutes\nCool to room temperature, serve", "uuid": "c4d8f722-e97d-4869-be3c-ecb59d4a7556"}]}, {"country": "Minnesota", "recipes": [{"serving": "4 to 6", "description": "Missouri does not have any official state food but it does have some edible state symbols and one of them is Morel mushroom. So here is one wonderful recipe.", "preparing_time": "40", "ingredients": ["1 -2 ounces dried morel mushrooms (or 8 ounces fresh morel mushrooms, cleaned and halved lengthwise*)", "3 cups chicken stock or broth", "1/4 cup unsalted butter", "1/3 cup finely chopped shallots", "1 tablespoon all-purpose flour", "1/2 teaspoon snipped fresh thyme", "1/4 teaspoon kosher salt", "1/4 teaspoon ground white pepper", "1 cup whipping cream or heavy cream", "1/4 cup snipped fresh Italian (flat-leaf) parsley", "Hot cooked pasta", "Snipped fresh Italian (flat-leaf) parsley (optional)"], "image": {"source_uri": "https://www.flickr.com/photos/davidreber/13912987907", "uri": "https://c2.staticflickr.com/6/5507/13912987907_cd0721d8a9.jpg", "description": "Morel Mushroom Cream Sauce with Pasta"}, "title": "Morel Mushroom Cream Sauce with Pasta", "directions": "You can use either dried or fresh mushrooms\n#When dried – heat 3 cups of the broth on a medium high heat, take away from the heat and pour the dried mushrooms in it\nLet the mushrooms soak for 20 minutes\nWhen soaked, pour the broth with the mushrooms over a clean cotton table cloth, reserve the broth \nRinse the mushrooms in warm water properly, then squeeze out all the unwanted moisture from them\nSlice the mushrooms lengthwise to even pieces, set aside\n#Sauce – melt ¼ cup of butter on a large saucepan over medium high heat\nChop the shallots finely, add them to the pan and stir fry for 3 to 5 minutes until soft\nScatter with flour, stir together until combined\nPour 1 cup of broth over the mixture, stir carefully until well combined\nReduce the heat and cook uncovered for 7 minutes\nSprinkle with thyme, white pepper and ¼ tablespoon of salt\nAdd the whipping cream and stir slowly, cook for another 7 minutes, stir constantly until the sauce thickens\nMix in the morels and sprinkle with ¼ cup of parsley\nCook until all the ingredients are hot\nServe over pasta, decorate with parsley", "uuid": "87b15910-b290-40e0-a52a-fdadcebf67d7"}, {"serving": "8", "description": "This dish originates from and is popular in the Upper Midwest region of the United States, especially the states of Minnesota and North Dakota.", "preparing_time": "95", "title": "Tater Tot Hotdish", "image": {"source_uri": "https://en.wikipedia.org/wiki/Hotdish", "uri": "https://upload.wikimedia.org/wikipedia/commons/8/80/Hotdish.jpg", "description": "Tater Tot Hotdish"}, "ingredients": ["1/4 cup extra-virgin olive oil", "1 medium yellow onion, finely chopped (about 2 cups)", "1 pound 80-percent lean ground beef", "Kosher salt and freshly ground black pepper", "2 cups frozen cut green beans, thawed (8 ounces)", "1 3/4 cups frozen corn kernels, thawed (8 ounces)", "Two 10-ounce cans cream of mushroom soup", "1 pound frozen shredded potato nuggets"], "directions": "On a large skillet heat oil over medium high heat\nSaute the onions for about 15 minutes until golden\nAdd the beef, stir occasionally and cook until the meat is brown (about 10 minutes), when finishing the meat scrape all the bits from the bottom of the pan and sprinkle with salt and pepper\nPour the mixture into a baking dish, spread the corn and the green beans on the top evenly\nPour cream of mushroom soup over the mixture\nScatter with frozen potato nuggets\nBake for 1 hour at 350°F, the meal is ready to serve when the potato nuggets are brown and crispy", "uuid": "ca807645-1eae-4b1c-9286-131c113fa5bf"}]}, {"country": "Mississippi", "recipes": [{"serving": "4", "description": "Mississippi's edible state symbols are largemouth bass, milk, wood duck, oysters and alligators. So here is one recipe for a alligator meat.", "preparing_time": "30", "title": "Blackened Alligator Steaks ", "image": {"source_uri": "https://en.wikipedia.org/wiki/Delmonico_steak", "uri": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Delmonico_steak.jpg", "description": "Blackened Alligator Steaks "}, "ingredients": ["1 teaspoon salt", "1 tablespoon paprika", "1 teaspoon garlic powder", "1 teaspoon ground cayenne pepper", "½ teaspoon freshly ground black pepper", "½ teaspoon freshly ground white pepper", "½ teaspoon dried thyme", "½ teaspoon dried oregano", "½ teaspoon dried chives", "3 tablespoons butter, melted ", "4 Alligator steaks, from the tail"], "directions": "Prepare a large plate and mix all the seasonings\nCoat the steaks with butter and dredge them in the seasonings, mix thoroughly from both sides\nPrepare a large skillet, do not pour any fat into it and heat for 5-7 minutes\nPut the steaks onto the pan and fry for 2 minutes on one side, turn them over and saute for 1-2 minutes, brush with butter", "uuid": "c9216030-2390-4253-af0f-90e8378bf3c7"}, {"serving": "8 to 10", "description": "The name \"Mississippi mud pie\" comes from the dense cake which resembles the banks of the Mississippi River.", "preparing_time": "190", "title": "Mississippi Mud Pie", "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Mississippi_mud_pie_(7963392610).jpg", "uri": " https://upload.wikimedia.org/wikipedia/commons/9/96/Mississippi_mud_pie_(7963392610).jpg", "description": "Mississippi Mud Pie"}, "ingredients": ["#Crust:", "9 chocolate graham crackers (1 sleeve)", "1/3 cup chopped pecans", "3 tablespoons unsalted butter, melted", "#Filling:", "1 stick unsalted butter, cut into pieces", "2 ounces unsweetened chocolate, chopped", "2 tablespoons all-purpose flour", "Pinch of salt", "1 1/4 cups granulated sugar", "2 tablespoons light corn syrup", "2 tablespoons coffee-flavored liqueur", "1 1/2 teaspoons vanilla extract", "3 large eggs", "#Topping:", "1 1/2 cups cold heavy cream", "1 tablespoon confectioners' sugar", "1/2 teaspoon vanilla extract", "3 tablespoons finely chopped pecans", "Chocolate sauce, for drizzling (optional)"], "directions": "#Crust – blend the Graham crackers with the pecan nuts until smooth\nAdd the melted butter and continue to blend until the mixture is well combined and moist\nKeep 2 tablespoons of the dough for later\nPress the rest of the mixture into the bottom and up the sides of a 9 inch pie plate\nBake in a preheated oven to 350°F for approximately 10 minutes, then let it cool\n#Filling – prepare the chocolate and the butter and put together on a medium heat on a sauce pan, let it melt\nWhen melted, set aside from the heat and add salt and flour and stir until well combined\nSlowly whisk in the coffee liquor, corn syrup, sugar and vanilla\nStart adding the eggs slowly, stirring in the process until fine\nWhen the filling is smooth, pour it onto the pie crust and bake for approximately 30 minutes until the top is cracked\nTake out of the oven, let it cool for about 2 hours\nWhipped cream – whisk together the heavy cream, confectioners‘ sugar and vanilla\nPlace it on top of the pie along with the reserved chocolate crumbles, pecans and chocolate sauce if desired\nServe slightly warm", "uuid": "035748db-9b3b-4959-92e3-4ef00b1e69f9"}]}, {"country": "Missouri", "recipes": [{"serving": "8", "description": "Missouri does not have any official state food but it does have some edible state symbols - The Channel Catfish, Eastern Black Walnut and Norton/Cynthiana grape. So here is one recipe for a Catfish.", "preparing_time": "45", "ingredients": ["8 skinned catfish fillets", "1 cup breadcrumbs", "1 cup grated parmesan cheese", "3⁄4 cup chopped fresh parsley", "1⁄2 teaspoon dried oregano", "1⁄4 teaspoon dried basil", "1 teaspoon paprika", "2 teaspoons salt", "1 teaspoon black pepper", "1⁄2 lb butter, melted", "lemon wedge", "parsley sprig"], "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Baked_Fish_in_Tomato_based_curry.JPG", "uri": "https://upload.wikimedia.org/wikipedia/commons/8/81/Baked_Fish_in_Tomato_based_curry.JPG", "description": "Baked Catfish"}, "title": "Baked Catfish", "directions": "Prepare a large baking dish and brush with oil\nPreheat the oven to 375°F\nTake the fish fillets and dry them with paper towels\nMix all the dry ingredients in a bowl, set aside\nBrush the fish with melted butter, then coat it in the bread crumbs properly from all sides\nPlace the fish on the baking dish, leave enough space between them\nBake in the oven for 20-30 minutes until the coating is golden and crispy and the fish flakes easily with a fork\nDecorate with parsley and lemon wedges before serving", "uuid": "3495b10e-30e8-4b4c-b982-0919c9ba6277"}, {"serving": "4 to 6", "description": "Fried Ravioli is an appetizer created and popularized in St. Louis, Missouri. Fried ravioli can be found on the menus of many St. Louis restaurants. Toasted ravioli may have originated in Sicily, where they are a traditional Christmas time dish.", "preparing_time": "10", "title": "Fried Ravioli", "image": {"source_uri": "https://en.wikipedia.org/wiki/Toasted_ravioli", "uri": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Toasted_Ravioli.jpg", "description": "Fried Ravioli"}, "ingredients": ["olive oil, for frying", "1 cup buttermilk", "2 cups Italian seasoned breadcrumbs", "1 (24 count) boxstore-bought cheese ravioli (about 24 ravioli)", "1⁄4 cup freshly grated parmesan cheese", "store bought marinara sauce, heated, for dipping"], "directions": "Prepare a large skillet and pour about 2 inches of olive oil onto it, let it heat on medium heat until the temperature reaches 325°F\nPrepare two bowls, pour the buttermilk into one and the bread crumbs to the other\nSoak every single ravioli first in the buttermilk and then dredge it in the breadcrumbs\nPlace all the raviolis on a baking sheet until needed\nWhen the olive oil is heated, start deep frying the raviolis, but be careful, they can not touch each other!\nTurn the ravioli occasionally, fry until they are light brown color (about 3 minutes)\nPlace the pasta on an absorptive paper to drain\nScatter with grated Parmesan cheese, serve hot with marinara sauce as a dip", "uuid": "646e3356-50e1-45e3-9231-d884502718d6"}]}, {"country": "Montana", "recipes": [{"serving": "4", "description": "The taste of beef burgers and buffalo burgers is very similar, but that buffalo burgers are a bit sweeter and more tender.", "preparing_time": "45", "ingredients": ["2 tablespoons olive oil, divided", "3 cups sliced onions (about 2)", "3⁄4 cup dry red wine (such as Cabernet Sauvignon)", "1 lb ground buffalo meat (bison)", "2 tablespoons chopped shallots", "1⁄4 teaspoon coarse kosher salt", "1⁄4 teaspoon dried thyme", "4 hamburger buns", "6 ounces sliced wisconsin white cheddar cheese", "2 -3 tablespoons Dijon mustard (to taste)", "1 small head escarole, leaves separated"], "image": {"source_uri": "https://pixabay.com/cs/photos/meat/", "uri": "https://pixabay.com/static/uploads/photo/2015/04/20/13/25/burger-731298_640.jpg", "description": "Bison Burger"}, "title": "Bison Burger", "directions": "On a large skillet add 1 tablespoon of oil, let it heat on medium heat and stir fry the onions until soft and golden (about 10 minutes), season with salt\nCook for another 15 minutes until brown and very soft, then pour the wine and simmer on medium heat for 5 minutes until the liquid is absorbed\nPrepare a large bowl and mix the meat with the other ingredients, then make 4 patties about ½ inch thick, season with salt and pepper\nPreheat the broiler\nHeat 1 tablespoon of oil on a large pan over high heat\nStart frying the burgers on the pan, about 2-3 minutes from each side, until brown\nPrepare the buns, cut them open and place them on the broiler cut side up\nTop with cheese and broil until the cheese melts for about 1 minute\nBrush the bottom halves with mustard, garnish with escarole leaves and put the burger patty on it\nSpread the top of the patty with the brown onion and cover with the top half of the bun\nRepeat with all the burgers, serve immediately", "uuid": "363c1d1a-eb22-49ed-8f82-d0d5102d9d65"}, {"serving": "10", "description": "This amazing cake is very popular and wild huckleberries will uncover the taste of the Montana countryside.", "preparing_time": "165", "ingredients": ["#Double Crust:", "2 1/2 cups all-purpose flour, plus more for dusting", "2 teaspoons sugar", "1 teaspoon kosher salt", "1/2 cup shortening", "1 stick (8 tablespoons) cold unsalted butter, cut into 1/2-inch pieces", "1 teaspoon apple cider vinegar", "5 to 8 tablespoons ice water", "#Filling:", "6 cups fresh huckleberries, or frozen thawed and drained", "3/4 cup plus 2 teaspoons sugar", "2 teaspoons orange zest", "2 tablespoons orange juice", "4 tablespoons instant tapioca", "1 large egg", "Sweetened whipped cream, for serving"], "image": {"source_uri": "https://en.wikipedia.org/wiki/Berry", "uri": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Best_Blueberry_Pie_with_Foolproof_Pie_Dough.jpg", "description": "Huckleberry Pie"}, "title": "Huckleberry Pie", "directions": "Filling – in a medium saucepan mix together 1 cup of huckleberries and ¾ cup of sugar, add orange zest and orange juice over medium heat\nCook for 5 minutes until the mixture is smooth and the berries are bursting\nLet it cool for a moment\nIn a large bowl combine the tapioca with 5 cups of huckleberries\nPour the cooked berries into the tapioca mixture, gently mix together\nPreheat the oven to 400°F\nCrust – in a blender combine the flour, sugar and salt, add the shortening and blend together, then add the butter and mix until crumbly, pour the apple cider vinegar and 4 tablespoons of cold water into it, pulse to cosine, continue with adding water until the batter stays together\nPlace on a lightly floured surface, roll into 11 inches in diameter and 1/8 inch thick circle\nPlace in the 9 inch pie plate, cut off the edges and put it in the fridge to cool down a bit\nPour the huckleberries into the pie shell, place the smaller circle of dough about 1/8 thick on top of the pie, seal the edges and crimp them decoratively\nMake small slits into the top dough\nCombine the egg with 1 teaspoon of water and cover the top with it, scatter with the remaining sugar (2 tablespoons)\nBake the cake on a baking sheet for 15 minutes (at 400°F), then reduce to 375°F and bake until golden brown and the filling is bubbling, about 50 minutes\nLet cool before serving, serve with whipped cream", "uuid": "9891dd2c-dab1-4564-8538-5cb2f819f1fd"}]}, {"country": "Nebraska", "recipes": [{"serving": "24", "description": "Nebraska has many ethnic groups, and each of them brought some traditional food. Here is one recipe form Czech Americans.", "preparing_time": "200", "ingredients": ["1/2 cup milk", "2 pkgs. active dry yeast", "1/2 cup warm water (110 to 115*)", "3/4 cup butter or regular margarine", "1/2 cup sugar", "1 tsp. Salt 4 egg yolks", "4 1/2 cup sifted flour Fillings (recipe below)", "2 tbsp. melted butter", "2 tbsp. sifted confectioners sugar"], "image": {"source_uri": "https://sk.wikipedia.org/wiki/Kol%C3%A1%C4%8D", "uri": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Kol%C3%A1%C4%8Dky.jpg", "description": "Kolaches"}, "title": "Kolaches", "directions": "Warm milk on low heat, do not boil, cool it to room temperature\nPour yeast into warm water and let dissolve\nWhisk butter, sugar, salt and egg yolks together until smooth\nPour the yeasty water into the butter mixture, add milk and ½ cup of flour, whisk for 5 minutes on medium heat until smooth\nScatter with flour gradually and knead until the batter no longer sticks to the edges of the bowl\nPrepare a lightly greased bowl, grease the batter from all sides\nLet the batter rise at a warm place, covered, for about 1 to 1 hour 30 minutes until doubled in size\nPut on a lightly floured surface and make 24 balls\nCover the dough and let rest for 10 to 15 minutes\nPrune filling – Prepare 30 prunes, cook until soft, drain, mill, add ¼ cup of sugar and ¼ tablespoon ground allspice (14 portions)\nApricot filling – prepare 25 apricot halves, cook until soft, drain, mill/blend/mash the apricots, add ¼ cup of sugar (10 portions)\nArrange the kolaches on a greased baking sheet about 2 inches apart from each other\nKnead each ball of batter from center outward with fingers to make a hole in center with a ½ inch rim around the edge\nPlace 1 tablespoon of the filling in the hollow\nCover again and let it rest in a warm place for 30 to 40 minutes\nPreheat the oven to 350°F\nBake the kolaches for 15 to 18 minutes until golden, cover the edges with melted butter and scatter with powdered sugar, place on racks to cool", "uuid": "08944e70-d627-4e83-bf64-8346ad27a9fb"}, {"serving": "10 meat pies", "description": "These meat pies are very popular. They are built to travel - great make ahead and heated for lunch.", "preparing_time": "220 ", "ingredients": ["#Dough:", "1/2 cup warm water (110 to 115 degrees F)", "1 packet active dry yeast", "1/4 cup sugar", "3/4 cup milk", "6 tablespoons unsalted butter", "4 1/4 cups all-purpose flour", "1 1/2 teaspoons kosher salt", "#Filling:", "3 tablespoons vegetable oil", "1 pound ground beef", "2 1/2 teaspoons kosher salt, plus more if needed", "3 cups chopped green cabbage (about 1/2 large head)", "2 cups chopped onion (about 1 large onion)", "1 teaspoon ground white pepper", "2 tablespoons unsalted butter, melted, for brushing", "Ketchup, for serving"], "image": {"source_uri": "https://en.wikipedia.org/wiki/Empanada", "uri": "https://upload.wikimedia.org/wikipedia/commons/9/97/Empanada_-_Stu_Spivack.jpg", "description": "Nebraska Handheld Meat Pies"}, "title": "Nebraska Handheld Meat Pies", "directions": "#Dough – dissolve the yeast in warm water and stir in 1 tablespoon of sugar\nSet aside until the yeast is bubbly on the top (about 10 minutes)\nIn a large pot heat milk with butter and cook until the butter melts, cool to 115°F\nMix the flour, salt and sugar in the bowl of a mixer with a dough hook, pour the yeasty water and the cooled milk over the flour mixture, start processing it with the dough hook\nThe dough is ready when smooth and no longer sticks to the edges of the bowl, that should take about 5 minutes\nCover with a plastic wrap and let it leaven at a warm place for 1 hour and 30 minutes at least\n#Filling – on a heated tablespoon of oil saute the meat until brown and crumbles to little pieces (about 5 minutes), season with ½ tablespoon of salt\nTransfer the meat into a large bowl\nHeat 2 tablespoons of oil on the skillet and add the cabbage and onions, simmer until soft and tender (about 15 minutes), season with 1 tablespoon of salt\nAfter 15 minutes add the beef back to the pan and cook it for another 5 minutes with the cabbage and onions\nSeason with white pepper and additional salt if desired\nTake away from the heat and let it chill completely\nPut the dough onto a floured surface, punch down the mass and separate into 10 balls of dough\nRoll each one into a rectangle about 6 by 8 inches\nSpoon the cold filling in the center of each rectangle, fold the two long sides together and pinch it together (the seam is facing up)\nPinch the short sides as well\nArrange the pies on a baking sheet, cover them with a kitchen towel and let them sit for about 20 minutes before baking\nBake in a preheated oven at 350°F for approximately 22 minutes until nutty brown \nServe with ketchup, serve hot", "uuid": "5a1d24f2-8790-4659-bd8f-a934bdebfb74"}]}, {"country": "Nevada", "recipes": [{"serving": "3", "description": "Do you like these crispy golden rings? Then you should know, this delicacy was born in Nevada.", "preparing_time": "20", "title": "Onion rings", "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Beer_Battered_Onion_Rings_(4957953795).jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/a/af/Beer_Battered_Onion_Rings_(4957953795).jpg", "description": "Onion rings"}, "ingredients": ["1 large onion, cut into 1/4-inch slices ", "1 1/4 cups all-purpose flour", "1 teaspoon baking powder ", "1 teaspoon salt ", "1 egg ", "1 cup milk, or as needed ", "3/4 cup dry bread crumbs ", "seasoned salt to taste", "1 quart oil for frying, or as needed"], "directions": "Slice the onions and divide them into individual onion rings\nPreheat the deep fryer to 365°F\nOn a plate mix together the flour, baking powder and salt\nBeat eggs and milk together\nScatter breadcrumbs on a shallow plate \nCover every onion ring in the flour mixture, set aside\nPour the egg mixture into the flour mixture, whisk until well combined\nDip every onion in the mixture and put on an aluminum foil\nDredge the rings in the bread crumbs, coat evenly from all sides, press the mixture properly into the onion\nStart frying the rings in small batches, they are ready when golden brown (about 2-3 minutes)\nPlace them on a kitchen towel to drain\nSprinkle with salt, serve hot", "uuid": "90c8209a-7978-41c8-9126-4d10b3f2480c"}, {"serving": "8 to 10", "description": "This delicious salad served in a local Basque houses. It is simple, but has a lot of flavor, especially if you like garlic! This salad is best served with chicken or steak.", "preparing_time": "20 ", "title": "Basque Salad", "image": {"source_uri": "https://www.flickr.com/photos/sixteenmilesofstring/8730244778", "uri": "https://c2.staticflickr.com/8/7422/8730244778_d9f0696510.jpg", "description": "Basque Salad"}, "ingredients": ["1 tablespoon olive oil", "2 garlic cloves, crushed", "3 tablespoons apple cider vinegar", "1⁄2 teaspoon salt", "1⁄4 teaspoon garlic powder", "1⁄2 cup mayonnaise", "1 hard-boiled egg, finely chopped", "salad greens"], "directions": "Chop the hard boiled egg and crush the garlic cloves\nIn a large bowl mix the olive oil, crushed garlic, apple cider vinegar, salt, garlic powder, mayonnaise and the chopped egg\nKeep in a cold place until needed\nMix with the greens right before serving, scatter the dressing carefully as the flavor is strong", "uuid": "7d5386e5-21a3-4f56-b13d-7c11fc428464"}]}, {"country": "New Hampshire", "recipes": [{"serving": "6 to 8", "description": "Pumpkin is official New Hampshire's state fruit. There are many recipes for Pumpkin Pie and other sweet recipes, so here is one less common recipe.", "preparing_time": "120", "title": "Stuffed Pumpkin", "image": {"source_uri": "https://www.flickr.com/photos/mealmakeovermoms/6263187291", "uri": "https://c1.staticflickr.com/7/6115/6263187291_b1481ce26d_b.jpg", "description": "Stuffed Pumpkin"}, "ingredients": ["1 large pumpkin (5-1/2 to 6 pounds)", "1 teaspoon salt, divided", "1-1/2 pounds ground beef", "3/4 cup finely chopped onion", "1 small green pepper, chopped", "1-1/2 cups cooked rice", "1 can (8 ounces) tomato sauce", "1/2 cup finely chopped fully cooked ham", "2 eggs, beaten", "1 garlic clove, minced", "1 teaspoon dried oregano", "1/2 teaspoon pepper", "1/2 teaspoon cider vinegar"], "directions": "Before cooking wash the pumpkin, carve a 6 inch wide circle around the top stem, remove the top, the seeds and the fiber inside\nTransfer the pumpkin into a dutch oven, pour boiling water 6 inches deep and seasonings with ½ tablespoon of salt\nSimmer covered for 30 minutes until soft, then remove from the heat and dry\nPrepare a large sauce pan, heat oil on medium heat and stir fry the meat and the veggies until tender\nLet the meat and veggies drain and cool \nPlace them in a large bowl, add the rice, oregano, vinegar, pepper, tomato sauce, garlic, ham, eggs, salt and combine \nPut them onto a baking pan and pour the meat mixture in, replace the top and bake in a preheated oven to 350°F for 1 hour\nLet it set for 10 minutes before cutting\nCut into wedges, serve hot", "uuid": "69a41474-0575-4fc6-97ae-ffa999f98518"}, {"serving": "24 pancakes", "description": "These wonderful American-style pancakes are light and moist. They are best made fresh and served up for brunch.", "preparing_time": "30 ", "title": "Blueberry Pancakes", "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Blueberry_pancakes_(4).jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Blueberry_pancakes_(4).jpg", "description": "Blueberry Pancakes"}, "ingredients": ["1 1⁄2 cups all-purpose flour", "1 tablespoon baking powder", "1 teaspoon ground cinnamon", "1 1⁄4 cups milk", "1 large egg", "1 tablespoon honey", "1 tablespoon brown sugar", "1⁄4 teaspoon salt", "1 cup blueberries", "#Cinnamon-sugar topping:", "1⁄4 cup brown sugar", "1⁄2 teaspoon ground cinnamon", "#Maple glaze:", "1⁄2 cup confectioners' sugar", "3 tablespoons maple syrup", "1⁄2 teaspoon vanilla extract"], "directions": "#Batter – prepare a large bowl, pour flour, baking powder and cinnamon, combine thoroughly\nIn another bowl mix milk, honey, brown sugar and salt\nPour the liquid ingredients into the dry ones, whisk until well combined and smooth\nMix in the blueberries and let it sit for 15 minutes\n#Topping – combine brown sugar with cinnamon\n#Maple glaze – pour maple syrup in a bowl and mix it in with confectioners’ sugar and vanilla extract\nHeat oil on a large saucepan\nPour the batter onto the pan, using about ¼ c of batter for each pancake\nCook until golden, pour some of the cinnamon sugar topping on the uncooked side of the pancake, then turn it over and cook until golden\nServe the pancakes with the glaze poured over them, serve hot", "uuid": "691ec73d-6065-4bea-b3b0-b42eae5b7c48"}]}, {"country": "New Jersey", "recipes": [{"serving": "2 pounds", "description": "New Jersey is best known for Saltwater Taffy, which is children's favourite delicacy during the holidays.\n", "preparing_time": "150", "title": "Saltwater Taffy", "image": {"source_uri": "https://www.flickr.com/photos/48590810@N04/4888591007", "uri": "https://c1.staticflickr.com/5/4081/4888591007_74a2a54bb4_b.jpg", "description": "Saltwater Taffy"}, "ingredients": ["2 cups sugar", "1 cup light corn syrup", "1 cup water", "1 1⁄2 teaspoons salt", "2 teaspoons butter or 2 teaspoons margarine", "1⁄4 teaspoon peppermint oil (or any other flavor you like)", "7 drops red food coloring or 7 drops green food coloring"], "directions": "Heat butter on a saucepan, add the sugar, water, salt and corn syrup\nSimmer on medium heat and stir frequently until well combined and the sugar melts\nCook until you reach 265°F without stirring, then remove from the heat\nAdd butter, color and flavoring\nPour into a pan and cool for at least 20 minutes or until elastic enough to handle easily\nBrush your hands with butter and pull the taffy until difficult to pull, then cut it into quarters\nProcess every candy into ½ inch thickness and cut into small pieces with buttered knife\nWrap in plastic foil", "uuid": "7225d5e5-e51c-43f8-b606-60647bde76aa"}, {"serving": "4", "description": "Pork Roll was created by John Taylor of Trenton, New Jersey in 1856. Let's try to create an authentic Jersey breakfast.", "preparing_time": "20", "ingredients": ["4 slices pork roll, such as Taylor (about 6 ounces)", "2 tablespoons unsalted butter", "4 kaiser rolls, split in half and toasted", "4 large eggs", "Kosher salt and freshly ground black pepper", "4 slices American cheese", "Ketchup, for serving, optional"], "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Pork_roll_egg_cheese_sand_readytoeat.JPG", "uri": "https://upload.wikimedia.org/wikipedia/commons/e/ee/Pork_roll_egg_cheese_sand_readytoeat.JPG", "description": "Pork Roll Sandwich with Egg & Cheese"}, "title": "Pork Roll Sandwich with Egg & Cheese", "directions": "Prepare the pork meat by scoring it on the edges on 3 or 4 places (it will cook more evenly)\nToast the roll bottoms\nOn a large saucepan melt the butter on medium high heat, add the pork and fry until golden from both sides (approximately 6 minutes)\nTake out the pork and set aside\nAdd butter to the pan and crack the eggs into it, break the membrane of the yolks and let it cook for about 2 minutes\nFlip the omelet over and place a slice of American cheese on each egg\nCover and let the cheese melt (about 30 seconds)\nTo assemble the sandwich, place one slice of pork on each toasted roll bottom, top with egg and cheese, sprinkle with ketchup if desired and cover with the top bun\nServe immediately", "uuid": "e6bc61cf-ad5c-4b0b-a0a0-90c4fd498adc"}]}, {"country": "New Mexico", "recipes": [{"serving": "8", "description": "This popular delicacy is among the New Mexico national dishes. Refritos beans are also popular in many Latin American countries.", "preparing_time": "165", "ingredients": ["1 pound dried pinto beans, picked over for stones and impurities", "2 tablespoons grapeseed oil", "1 large red onion, diced", "3 cloves garlic, lightly crushed with the side of a knife blade, and minced", "1 tablespoon Mexican chili powder", "Salt and freshly ground black pepper", "1 tablespoon minced fresh cilantro leaves or minced fresh flat-leaf parsley"], "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Frijoles_refritos.jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/5/51/Frijoles_refritos.jpg", "description": "Frijoles Refritos"}, "title": "Frijoles Refritos", "directions": "Rinse the beans and cook them in 8 cups of water\nRemove anything that rises to the surface when cooking\nAfter 15 minutes of cooking, pour the beans into a colander and rinse\nClean the pot and put 8 cups of fresh water, start slowly cooking the beans again until soft (about 2 hours) on low heat\nPrepare a large skillet and heat oil on it on medium heat\nAdd the onions and garlic, stir fry until the onions are translucent\nSeason with salt, pepper and chilli powder and simmer for a few minutes\nAdd the cooked beans and mash all the ingredients together\nWarm, serve with sprinkled cilantro and parsley on top", "uuid": "011cb580-afa1-4797-986a-4ea67d18c9bf"}, {"serving": "2 cups", "description": "In New Mexico, green chile is a popular ingredient in a wide range of foods including enchiladas and burritos, cheeseburgers, french fries, bagels, pizzas.", "preparing_time": "35", "ingredients": ["1 tablespoon canola oil", "1⁄2 cup finely chopped onion", "2 cloves garlic, minced", "2 tablespoons flour or 2 tablespoons whole wheat flour", "1⁄4 teaspoon ground cumin", "salt and pepper, to taste", "1 1⁄2 cups pork stock or 1 1⁄2 cups chicken stock", "1 cup chopped roasted and peeled new mexico pepper (\"or\" frozen \"or\" canned)", "1⁄4 teaspoon dried oregano"], "image": {"source_uri": "https://en.wikipedia.org/wiki/Salsa_verde_(Mexico)", "uri": "https://upload.wikimedia.org/wikipedia/commons/9/99/SALSA_VERDE.jpg", "description": "Green Chile Sauce"}, "title": "Green Chile Sauce", "directions": "Prepare a large pan and heat oil on medium-high heat, stir fry the onions and garlic until softened (about 3 minutes)\nAdd flour to the pan, season with salt, pepper and cumin, stir occasionally and simmer for 2 minutes on medium heat\nStir in the stock and cook until fine, mix in the oregano and the chiles\nIf serving right away, heat well\nIf storing for later, keep covered in the fridge", "uuid": "86abe3f3-e291-4a43-a53d-20ac1254142e"}]}, {"country": "New York", "recipes": [{"serving": "6", "description": "Buffalo wings were first prepared at the Anchor Bar in Buffalo, New York, by Teressa Bellissimo. There is also officially Chicken Wing Day (declared July 29, 1977) in Buffalo.", "preparing_time": "95", "title": "Buffalo Wings", "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Buffalo_wings-01.jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/5/51/Buffalo_wings-01.jpg", "description": "Buffalo Wings"}, "ingredients": ["2 1/2 pounds chicken wings, tips removed and wings halved at joint, or wingettes", "6 tablespoons unsalted butter, melted", "1/4 cup honey", "1/4 cup bottled hot sauce, such as Frank's", "2 teaspoons paprika", "1 teaspoon kosher salt", "1/4 teaspoon cayenne pepper", "Nonstick spray, for greasing", "Blue Cheese Dipping Sauce, for serving, recipe follows", "Celery sticks, for serving", "#Blue cheese dipping sauce:", "1 cup crumbled blue cheese", "3/4 cup mayonnaise", "1/2 cup sour cream", "1 teaspoon Worcestershire sauce", "Kosher salt and cracked black pepper"], "directions": "Arrange the raw chicken wings on a plate\nPreheat the oven to 425°F\nOn a large skillet melt butter and set aside from the heat, add the hot sauce, honey, pepper, salt and cayenne pepper, mix until combined, let it cool\nWhen the sauce is cooked, pour it over the chicken wings, coating them from all sides properly\nLet the wings marinate at room temperature for about 20-25 minutes\nIn the meantime prepare the blue cheese dip – in a blender combine the mayonnaise, blue cheese, Worcestershire sauce and sour cream, blend until smooth, season with salt and pepper\nArrange the Buffalo wings on a baking pan lined with greased aluminum foil\nBake the chicken wings in the oven for 45 minutes, rotate them once in the process\nServe hot with the Blue cheese dipping sauce", "uuid": "6faf06f8-94a4-4315-9437-abccca09e9cf"}, {"serving": "24", "description": "These delicious muffins are among the New York's national dishes. They are wonderful with cup of tea or coffee.", "preparing_time": "40", "ingredients": ["2 cups all-purpose flour", "3/4 cup packed brown sugar", "1/2 cup sugar", "2 teaspoons baking soda", "1-1/2 teaspoons ground cinnamon", "1/2 teaspoon salt", "1/4 to 1/2 teaspoon ground cloves", "1/8 teaspoon ground nutmeg", "3 eggs", "1/2 cup butter, melted", "1 package (3 ounces) cream cheese, cut into 1/4-inch cubes and softened", "1/2 teaspoon vanilla extract", "2 cups chopped peeled apples", "1/2 cup raisins", "1/2 cup chopped walnuts", "#Topping:", "1/2 cup packed brown sugar", "1/2 cup finely chopped walnuts", "1/4 cup all-purpose flour", "2 tablespoons butter, melted", "1 teaspoon ground cinnamon", "1 teaspoon grated lemon peel"], "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Vegan_Apple_Cinnamon_Muffins_(3879653091).jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Vegan_Apple_Cinnamon_Muffins_(3879653091).jpg/1234px-Vegan_Apple_Cinnamon_Muffins_(3879653091).jpg", "description": "Apple Muffins"}, "title": "Apple Muffins", "directions": "Preheat the oven to 375°F\nCombine all the dry ingredients in a large bowl\nMix eggs, cream cheese, butter and vanilla in the second bowl, mix until well combined\nPour the liquid ingredients into the dry ones, whisk thoroughly\nAdd the raisins, walnuts and grated apples\nCombine the ingredients for the sugary topping\nFill the muffin cups to 2/3\nScatter with the topping\nBake for 20-25 minutes, let cool and serve", "uuid": "ef6cc034-6128-4bdc-b338-d471f2737401"}]}, {"country": "North Carolina", "recipes": [{"serving": "6 to 8", "description": "Pulled pork is a method of cooking pork , allowing the meat to become tender enough so that it can be \"pulled\", or easily broken into individual pieces.", "preparing_time": "495", "title": "Pulled Pork", "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Pulled_pork_(13564142705).jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/9/99/Pulled_pork_(13564142705).jpg", "description": "Pulled Pork"}, "ingredients": ["1 (3 lb) pork roast, trimmed of all fat", "2 cups onions, chopped", "1⁄2 cup brown sugar, packed", "1⁄4 cup white vinegar", "6 ounces tomato paste (small can)", "1 1⁄2 tablespoons chili powder (the hot stuff. Chipotle works well, too)", "1 teaspoon dry mustard", "2 teaspoons Worcestershire sauce", "1⁄4 cup water", "2 teaspoons salt", "3 garlic cloves (add or subtract to your heart's content)", "pepper", "#For Garnish:", "8 -12 kaiser rolls", "horseradish", "1 cup shredded cheddar cheese"], "directions": "Prepare a slow cooker, put all the ingredients in but the pork\nSplit the meat into 4 parts\nFry the pork until brown in a heavy bottomed pan over medium high heat\nPlace the pork into the slow cooker, stir in with the sauce\nCook for 8 hours on low\nAfter 8 hours try if the meat is done with a fork (if it does not shred under the fork it is not done)\nMix the mixture to cover all the pork pieces with the sauce\nWarm the buns, coat with horseradish on the bottom half, top with pork, sprinkle with grated cheddar", "uuid": "3b70e9ca-ef70-4278-83bc-86f4052ab64c"}, {"serving": "8", "description": "There is no official state food, but Sweet potatoes is one of the North Carolina's state symbols. So here is an interesting recipe with sweet potatoes.", "preparing_time": "75", "ingredients": ["1 (9 inch) unbaked pie crust ", "2 cups cooked and mashed sweet potatoes ", "2 eggs ", "3/4 cup white sugar", "1/2 teaspoon salt ", "1 teaspoon ground cinnamon ", "1/2 teaspoon ground ginger ", "1/4 teaspoon ground cloves ", "1 2/3 cups light cream ", "3 tablespoons butter, softened ", "2/3 cup packed brown sugar", "2/3 cup chopped pecans"], "image": {"source_uri": "https://en.wikipedia.org/wiki/Pecan_pie", "uri": "https://upload.wikimedia.org/wikipedia/commons/4/48/Pecan_pie_slice_(cropped).jpg", "description": "Sweet Potato Pecan Pie"}, "title": "Sweet Potato Pecan Pie", "directions": "Preheat the oven to 400°F\nBake the sweet potatoes in the oven, then take them out, peel and mash them\nWhisk eggs gently and pour to the sweet potato mash, combining it properly\nSeason the dough with cinnamon, salt, ginger and sugar, mix in the cream\nPour the mixture into a pie pan\nBake for 45-55 minutes, try with a toothpick if it is done (if it does not stick to the toothpick it is ready)\nTopping – broil the brown sugar, pecans and butter, when it goes bubbly (about 3 minutes) cool it and start spreading it on the top of the pie", "uuid": "5fcd8bbf-8154-498a-be08-d96190e23ea5"}]}, {"country": "North Dakota", "recipes": [{"serving": "28", "description": "Lefse is a Scandinavian treat that is especially popular around the holidays. Many Scandinavian-Americans eat lefse primarily around Thanksgiving and Christmas.", "preparing_time": "120", "title": "Lefse", "image": {"source_uri": "https://www.flickr.com/photos/notahipster/4259059483", "uri": "https://c1.staticflickr.com/5/4061/4259059483_ef50a696c8_b.jpg", "description": "Lefse"}, "ingredients": ["1 3⁄4 lbs russet potatoes", "1⁄2 cup heavy cream", "4 tablespoons unsalted butter", "2 teaspoons sugar", "1 1⁄2 teaspoons kosher salt", "1 3⁄4 cups all-purpose flour, plus more for rolling"], "directions": "Put whole unpeeled potatoes into a large pot, pour over with cold water by 2 inches\nBring to a boil and cook for about 40 minutes until the potatoes are tender\nWhen cooked, peel the potatoes and mash them using a fork or a masher\nPour the heavy cream, butter, salt and sugar into a small pot and heat until the butter dissolves\nTake 4 cups of the potato mash into a large bowl and pour the milky mixture over it, stir it lightly\nPut into a fridge for 30 minutes and let it chill\nWhen completely cooled, take it out of the fridge and sprinkle flour over it, work it gently into the dough\nLet it sit in room temperature for 10 minutes\nNow you can start making small balls of dough (about 2 tablespoons per serving)\nPlace the balls on a lightly floured parchment sheet\nRoll the balls of dough using a rolling pin into circles with a thickness of approximately 1/16 inch and 7 inches wide\nPrepare a non stick pan and heat it\nStart scraping the thin layers of dough from the paper into your hand and place them on the pan\nSaute for 1 minute, then flip it over and cook from the other side for 30 seconds\nPlace the finished lefses on a plate, covered with kitchen towel and keep them warm\nWhen serving, sprinkle with sugar and pour melted butter, roll each lefse", "uuid": "1f953909-769c-4101-9845-6da86236d5c4"}, {"serving": "4", "description": "This fresh soup is traditional native North Dakota food. And it is popular dish during the summer season.", "preparing_time": "35", "title": "Summer Corn Soup", "image": {"source_uri": "https://www.flickr.com/photos/gogatsby/5279617318", "uri": "https://c2.staticflickr.com/6/5169/5279617318_ceda64242f_b.jpg", "description": "Summer Corn Soup"}, "ingredients": ["2-3 Tbsp Olive oil", "1/2 large white onion, chopped (~1 cup)", "2 cloves garlic, minced", "4 small red potatoes (or 1 small russet), quartered (peeling, optional)", "Sea salt and ground black pepper", "3 ears corn (or 1.5 cans), kernels sliced off", "2 cups low sodium veggie broth", "2 cups unsweetened plain almond milk (or regular milk if not vegan)", "2-3 green onions (garnish), chopped", "1-2 Tbsp nutritional yeast for a cheesy flavor"], "directions": "Stir fry onions and garlic on a large pan on medium heat, saute until brown (3-4 minutes)\nPut in the potatoes, sprinkle with salt and pepper and simmer covered for 4-5 minutes\nAdd the corn (save some for later)\nYou can either blend the soup or not \nBlend the soup – add half broth and half milk for better creamy texture\n#Not blended – use all the broth for better flavor\nPour the broth (the milk) into the pan, reduce the heat to low and cook until the potatoes are tender (about 5 minutes)\n#Blending – add 3/4 into a blender and blend until smooth\nPut the soup back into the pan and let it simmer (the longer the better)\nServe hot, decorate with chopped green onion and the corn, sprinkle with paprika and black pepper", "uuid": "afbfe4f7-1f11-4c79-86e0-ce937847ded0"}]}, {"country": "Ohio", "recipes": [{"serving": "30", "description": "Ohio is known as the Buckeye state - It is the state tree, the name of Ohio State University's sports teams, a nickname for local residents and the name of the peanut butter and chocolate balls which look like the nuts that fall from the same-named tree.", "preparing_time": "65", "title": "Buckeyes", "image": {"source_uri": "https://www.flickr.com/photos/stevendepolo/3609747366", "uri": "https://c2.staticflickr.com/4/3376/3609747366_261e6fc7b6.jpg", "description": "Buckeyes"}, "ingredients": ["2 1/2 cups sifted confectioners' sugar", "1 cup smooth peanut butter", "5 tablespoons unsalted butter, melted", "1/2 teaspoon vanilla extract", "1/4 teaspoon kosher salt", "12 ounces semisweet or bittersweet chocolate, chopped", "1 1/2 teaspoons shortening"], "directions": "Prepare a blender and add peanut butter, butter, confectioners’ sugar, vanilla and salt\nBlend until smooth and combined properly\nMake them into 1 inch balls, arrange them on a parchment paper and freeze them for about 20 minutes or until hard\nChop the chocolate and add the shortening, place into a microwavable bowl and microwave for 2 minutes, stir every 30 seconds until completely dissolved\nPierce every candy ball with a toothpick and cover it in the melted chocolate, but leave a circle as large as an eye still visible (uncovered with chocolate)\nLet the excess chocolate drain\nPut the buckeyes into a freezer and freeze until hard\nBefore serving, cover the hole after the toothpick and serve at room temperature", "uuid": "a8fcf6ef-e073-45ab-9e12-273479c59f21"}, {"serving": "10", "description": "Cincinnati Chili is spiced meat sauce used as a topping for spaghetti or hot dogs, both dishes developed by Macedonian immigrant restaurateurs in the 1920s.", "preparing_time": "105", "title": "Cincinnati Chili", "image": {"source_uri": "https://www.flickr.com/photos/breville/8736371644", "uri": "https://c2.staticflickr.com/8/7319/8736371644_ec7880ca20_b.jpg", "description": "Cincinnati Chili"}, "ingredients": ["2 lbs ground beef", "2 cups chopped onions", "4 cups beef stock", "2 (8 ounce) cans tomato sauce", "2 -3 tablespoons chili powder", "2 tablespoons apple cider vinegar", "2 teaspoons Worcestershire sauce", "1⁄2 ounce grated unsweetened chocolate or 2 3⁄4 tablespoons cocoa", "2 teaspoons instant minced garlic", "1 teaspoon ground cinnamon", "1 teaspoon ground cumin", "1⁄2 teaspoon salt", "1⁄2 teaspoon ground red pepper or 1⁄2 teaspoon cayenne pepper", "1⁄4 teaspoon ground allspice", "1⁄4 teaspoon ground cloves", "1 bay leaves or 1⁄8 teaspoon bay leaf powder", "#Topping:", "chopped onion (optional)", "finely shredded cheddar cheese (certainly NOT optional)", "kidney bean (optional)"], "directions": "On a large skillet heat oil and stir fry the onions until transparent, add the ground beef and saute until brown\nRemove the mixture from the pan and let it drain\nAdd the beef stock to the mixture and simmer together for 10 minutes\nAdd all the remaining ingredients and cook uncovered for about an hour\nBefore serving remove the bay leaf and take out the excess fat\nServe over spaghetti or in hot dog buns\nSprinkle with lots of cheese", "uuid": "9d566381-9801-47d8-ab27-9b5562b54c5d"}]}, {"country": "Oklahoma", "recipes": [{"serving": "4", "description": "Cornmeal Okra is popular Oklahoma delicacy and it is no wonder that fried okra is among the Oklahoma's national dishes.", "preparing_time": "50", "title": "Cornmeal Okra", "image": {"source_uri": "https://en.wikipedia.org/wiki/Akan_cuisine", "uri": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Ghanaian_Fried_Plantains.jpg", "description": "Cornmeal Okra"}, "ingredients": ["4 cups vegetable oil", "1/4 cup all-purpose flour", "1/2 cup cornmeal", "1/2 teaspoon freshly ground black pepper", "1/2 teaspoon ground paprika", "1/2 teaspoon garlic powder", "2 egg whites", "Kosher salt", "2 cups fresh okra, washed and dried well, tips removed", "Chipotle Sour Cream, recipe follows", "Chipotle Sour Cream", "1 cup sour cream", "Juice of 1/2 lime", "1 canned chipotle pepper in adobo sauce, finely chopped", "Kosher salt and freshly ground black pepper"], "directions": "Heat oil to 350°F in a heavy bottomed pan over medium heat\nArrange paper towels on a baking tray\nIn a bowl mix the flour, black pepper, garlic powder, paprika and cornmeal\nWhisk egg whites with salt until the mixture is foamy\nSouse the okra first in the egg whites then in the spicy flour mixture\nStart frying the okras in the preheated oil\nTurn frequently and fry until light brown\nPlace them on a tray, let drain on the paper towels, sprinkle with salt\nChipotle sour cream – in a bowl mix the sour cream, chopped chipotle pepper, lime juice and salt and pepper\nServe the okras hot with the Chipotle sour cream dip", "uuid": "f01bc341-0fc4-4662-9fe6-481cfe0aa358"}, {"serving": "4", "description": "Chicken fried steak (also called country fried steak) is an American breaded cutlet dish consisting of a piece of steak coated with seasoned flour and pan-fried. It is among the Oklahoma's national dishes.", "preparing_time": "30", "ingredients": ["2 1⁄4 teaspoons salt, divided", "1 3⁄4 teaspoons black pepper, divided", "4 (4 ounce) cube steaks", "38 saltine crackers, crushed", "1 1⁄4 cups all-purpose flour, divided", "1⁄2 teaspoon ground red pepper", "1⁄2 teaspoon baking powder", "4 3⁄4 cups milk, divided", "2 large eggs", "3 1⁄2 cups peanut oil"], "image": {"source_uri": "https://en.wikipedia.org/wiki/Schnitzel", "uri": "https://upload.wikimedia.org/wikipedia/commons/f/f8/Israeli_schnitzel_and_pasta.jpg", "description": "Chicken Fried Steak"}, "title": "Chicken Fried Steak", "directions": "Season the steaks with ¼ teaspoon of salt and pepper from both sides\nIn a large bowl combine 1 cup flour, 1 teaspoon of salt, cracker crumbs, ½ teaspoon black and red pepper and baking powder\nStir up ¾ cup of milk and eggs\nStart coating the steaks first in the flour mixture, then in the milk, then again in the flour\nHeat oil in 12 inch saucepan to 360°F\nFry the steaks for 3 to 4 minutes from one side, then turn and fry for 2-3 minutes or until brown\nRemove the steaks from the heat, keep them warm in an oven preheated to 225°F\nDrain the fat from the steaks, keep 1 tablespoon of the gravy in the pan\nMix ¼ cup of flour, 4 cups of milk, 1 teaspoon of salt and 1 teaspoon of black pepper\nPour the mixture into the pan, whisk constantly over medium high heat and cook for 10-12 minutes\nServe the hot steaks with the gravy", "uuid": "1fb11bdf-d423-43ec-846b-bf3c943ab0a5"}]}, {"country": "Oregon", "recipes": [{"serving": "4 to 8", "description": "Popular foods traditionally connected with Oregon include hazelnuts, berries, modern maraschino cherries & Dungeness crab.", "preparing_time": "130", "title": "Roasted Dungeness Crabs", "image": {"source_uri": "https://www.flickr.com/photos/fabulousfabs/7115091877", "uri": "https://c2.staticflickr.com/6/5463/7115091877_9fd5394d14_b.jpg", "description": "Roasted Dungeness Crabs"}, "ingredients": ["1 1/2 teaspoons salt, plus more for cooking the crabs ", "1 lemon, thinly sliced ", "1 head garlic, minced, peels reserved", "1 onion, minced, peel reserved", "4 large Dungeness crabs, 1 1/4 to 1 1/2 pounds each ", "1 cup (2 sticks) unsalted butter", "1 cup olive oil", "2 teaspoons crushed red pepper, or 6 to 8 fresh red chiles, such as serrano, minced and seeded, or to taste", "1/2 teaspoon ground black pepper", "3/4 cup chopped fresh parsley or cilantro leaves"], "directions": "Preheat the oven to 450°F\nPrepare a large pot and fill into 2/3 with water\nAdd salt until the water tastes like seawater\nPut the peels from the garlic and onion and half of the sliced lemon into the pot and bring to a boil\nPlace the crabs in the water and simmer for 5 minutes\nRemove from the heat and let the crabs cool down \nWhen the crabs are cold, discard the top shell and apron, take out the gills and cartilage and remove the fat\nWash the crab in cool running water\nPut crabs on a dry surface (top side up) and cut lengthwise into halves\nIn a large roasting pan mix the minced garlic, chopped onion, ½ teaspoon of salt, butter, crushed red pepper, black pepper and olive oil\nPut the pan in the oven on the lowest rack and bake for 8 minutes, stirring occasionally, until the veggies are light brown\nRemove from the oven, add the crabs and coat from all sides with the onion mixture\nReturn it to the oven, bake until the meat is heated and the mixture is stewed onto the shells (13-15 minutes)\nServe hot, decorate with chopped parsley and cilantro", "uuid": "43840f52-ee7d-48f3-b39f-a4069af336bf"}, {"serving": "4 to 6", "description": "Chanterelle mushrooms are among the Oregon's edible state symbols. So let's try to make soup with fresh Chanterelles.", "preparing_time": "60", "title": "Chanterelle Soup", "image": {"source_uri": "http://www.geograph.org.uk/photo/920622", "uri": "http://s0.geograph.org.uk/photos/92/06/920622_119da16f.jpg", "description": "Chanterelle Soup"}, "ingredients": ["#Veloute:", "6 cups chicken stock, or pheasant, turkey or quail stock (you can go with duck or goose stock if you use morels, cremini or porcini mushrooms)", "2 tablespoons unsalted butter", "2 tablespoons flour", "#Soup:", "1 pound fresh mushrooms", "2 minced shallots", "4 tablespoons unsalted butter", "3 egg yolks", "1/2 cup cream", "1 shot brandy (Armagnac is my preference)", "1/4 teaspoon saffron", "Salt to taste"], "directions": "In a large pot cook veloute sauce, heat it \nIn another pot melt butter and mix with flour, cook over medium heat for a few minutes (can't get brown!)\nPour the hot veloute over the roux and cook for 20 minutes, stir frequently\nSimmer until reduced to ¼ and smooth\n#Mushroom base – finely chop the shallots and mushrooms, saute on a pan over medium heat, season with salt, stir fry until the onions are transparent and mushrooms gave up their water\nAdd saffron into the brandy and pour to the pan, cook on high heat and combine all the ingredients\nLet simmer until the brandy is almost gone, then put away from the heat\nPour the mushroom base into a blender and make into puree\nAfter the veloute is reduced to ¼, pour the mushroom puree and mix in properly, cook for about 10 minutes\n#Mushroom garnish – chop a few chanterelles lengthwise, saute in a pan until brown, mix the egg yolks with cream and slowly pour about 4 ladles of soup into the eggs, then add it back to the soup and cook (not boil!)\nIf you want your soup very smooth, put it through a fine-mesh strainer, then return to low heat\nFinish your soup with adding the butter, stirring it in thoroughly\nServe with the fried mushrooms in the center and crusty bread", "uuid": "6fb4a457-dcd4-4f51-a786-5f7453a0ef29"}]}, {"country": "Pennsylvania", "recipes": [{"serving": "4", "description": "Ruffed grouse is among the Pennsylvania's edible state symbols. So here is one amazing popular recipe.", "preparing_time": "50", "ingredients": ["2 tablespoons butter ", "2 cloves garlic, sliced ", "2 (1 pound) grouse, cut into quarters and patted dry ", "1/4 cup dry sherry or white wine", "1/4 cup chicken stock ", "2 teaspoons chopped fresh tarragon ", "1/4 cup peach or apricot jam", "1 teaspoon balsamic vinegar, or to taste"], "image": {"source_uri": "https://en.wikipedia.org/wiki/List_of_chicken_dishes", "uri": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Korean.cuisine-Andong.jjimdalk-01.jpg", "description": "Sauteed Grouse with Peach-Balsamic Sauce"}, "title": "Sauteed Grouse with Peach-Balsamic Sauce", "directions": "Prepare a large pan and stir fry the garlic on melted butter over low heat\nSimmer for 10 minutes until the butter has a garlic flavor, then take out the garlic\nIncrease the heat to medium-high and heat the butter, when hot add the grouse and fry until light brown (about 3 minutes) from both sides, take it out \nAdd the sherry into the pan and cook for 20 seconds, then pour in the chicken stock, peach jam and tarragon, cook until bubbling and then reduce the heat to medium-low, cook for another 5 minutes under the lid\nPour in the balsamic vinegar, simmer covered for another 2 minutes\nPut the sauteed grouse back to the pan, cooked until tender 3-5 minutes", "uuid": "574ffb82-20b3-4875-a8bf-dd59a8b6bcaa"}, {"serving": "2", "description": "This traditional sandwich is Pennsylvania favorite lunch at the luncheonettes (sandwich shops).", "preparing_time": "25", "ingredients": ["2 fresh Italian rolls or 2 kaiser rolls, split in half crosswise", "1 white onion, thinly sliced", "1⁄2 large green bell pepper, thinly sliced", "1 teaspoon minced garlic", "1⁄2 teaspoon salt", "1⁄4 teaspoon ground black pepper", "1⁄2 lb rib eye steak, very very thinly sliced", "1⁄3 lb thinly sliced white processed cheese or 1⁄3 lb provolone cheese or 4 ounces melted Cheese Whiz", "ketchup, topping (optional)", "pepperoncini pepper, accompaniment", "olive oil"], "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Philly_cheese_steak.JPG", "uri": "https://upload.wikimedia.org/wikipedia/commons/5/50/Philly_cheese_steak.JPG", "description": "Philly Cheese Stake"}, "title": "Philly Cheese Steak", "directions": "Heat oil on a cast-iron saucepan over medium heat\nStir in the bell peppers, onions and saute until golden brown (about 6 minutes)\nPut in the minced garlic, season with salt and pepper and cook for 30 seconds\nPlace the mixture on one side of the pan and add the meat, fry for about 2 minutes until brown\nMix the meat with the sauteed vegetables, add cheese slices on the top and let melt\nWarm the buns\nPlace the meaty filling into the warm buns, serve immediately with condiments if desired", "uuid": "4307086e-092e-4b9b-a422-431b13948b9e"}]}, {"country": "Rhode Island", "recipes": [{"serving": "6 to 8", "description": "Clam cakes are a summer tradition in Rhode Island. They are particularly popular during \"clamming\" season when clams are in abundance and it is legal to dig your own.", "preparing_time": "15", "title": "Clam Cakes", "image": {"source_uri": "https://en.wikipedia.org/wiki/Hushpuppy", "uri": "https://upload.wikimedia.org/wikipedia/commons/3/31/Hushpuppies_5stack.jpg", "description": "Clam Cakes"}, "ingredients": ["1 recipe for remoulade", "Canola or other vegetable oil for frying", "3 beaten eggs", "1/2 cup buttermilk", "1/2 cup clam broth", "1/2 cup cold beer", "2 teaspoons maple syrup", "1 1/2 cups chopped or ground clams", "1 teaspoon salt", "2 1/2 teaspoons baking powder", "3 1/2 cups cake flour, or all-purpose flour"], "directions": "Heat oil on a large skillet to 350°F\nMake the remoulade, let cool\nIn a large bowl mix all the liquid ingredients but the beer\nIn another bowl mix all the dry ingredients until combined\nPrepare a plate, cover in paper towels\nWhen oil is heated, add the beer into the liquid ingredients bowl and whisk gently\nStart pouring the batter into the oil, one tablespoon at a time, leave enough space between the cakes\nFry for about 30 seconds, turn them over and fry for about 5 minutes until the cakes are golden on both sides \nPlace the cakes on paper towels and let them drain, serve hot with the remoulade, Tabasco or tartar sauce", "uuid": "319bb54b-9736-463b-9172-b37ee593c967"}, {"serving": "4", "description": "Striped Bass is among the Rhode Island state symbols. And here is one popular recipe.", "preparing_time": "30", "ingredients": ["1⁄2 cup extra virgin olive oil", "juice of 2 limes", "zest of 2 limes", "1⁄2 cup cilantro, chopped", "2 cloves garlic, chopped", "salt", "cracked black pepper, to taste", "4 (8 ounce) striped bass, filets"], "image": {"source_uri": "https://www.flickr.com/photos/anemoneprojectors/11476849023", "uri": "https://c2.staticflickr.com/6/5512/11476849023_d18eaf41c6_b.jpg", "description": "Grilled Striped Bass"}, "title": "Grilled Striped Bass", "directions": "In a large bowl mix lime juice, lime zest, cilantro, olive oil and garlic\nSeason with salt and pepper\nCut 3 diagonal slits through the skin of each bass\nTransfer the fillets into the marinade and coat the fish thoroughly from both sides\nPlace it on a large plate, cover and let marinate in the fridge for 1 hour\nTurn the grill to medium high heat\nCook the fish for about 8 minutes from both sides until tender ", "uuid": "60d8d153-4a72-42e4-a1fd-deb88fc777c9"}]}, {"country": "South Carolina", "recipes": [{"serving": "4", "description": "Oyster season runs from September/October through April. During this season there are plenty of festivals celebrating the oyster to give you a chance to slurp down as many as you can.", "preparing_time": "30", "ingredients": ["3 (12 ounce) bottles dark beer", "2 clean, white dish towels", "28 oysters, preferably from the East coast, scrubbed well", "Salt and freshly ground black pepper", "#Home-made Hot Sauce:", "1 cup red wine vinegar", "2 tablespoons Dijon mustard", "1 tablespoon chipotle pepper puree", "1 tablespoon honey", "1/2 teaspoon salt"], "image": {"source_uri": "https://en.wikipedia.org/wiki/Food_and_drink_prohibitions", "uri": "https://upload.wikimedia.org/wikipedia/commons/3/37/Oysters_p1040741.jpg", "description": "Roasted Oysters in Beer "}, "title": "Roasted Oysters in Beer ", "directions": "Preheat the oven to 450°F\nPrepare a large baking pan and let it warm in the oven\nPour 2 bottles of beer in a large bowl, top with the towels and let them soak, wring lightly\nWhen the pan is heated pour the bottle of beer into it and add the oysters, sprinkle with salt and pepper\nTop them with the soaked towels and bake for 8-10 minutes or until the oysters open (remove the ones that did not)\n#Home made hot sauce – in a small bowl mix together all the ingredients\nServe hot with the hot sauce", "uuid": "b4ad09d4-f671-4f48-a92d-d53a67c0ac24"}, {"serving": "8", "description": "They are official state snack. Search for them at roadside stands during the summer and early fall because that’s when they are best.", "preparing_time": "1 day 20", "ingredients": ["1 pound raw peanuts, in shells", "1 (3 ounce) package dry crab boil ", "1/2 cup chopped jalapeno peppers ", "1 tablespoon garlic powder ", "1/2 cup salt ", "2 tablespoons Cajun seasoning ", "1/2 cup red pepper flakes"], "image": {"source_uri": "https://www.flickr.com/photos/scaredykat/2360215046", "uri": "https://c2.staticflickr.com/4/3124/2360215046_220d0073f7.jpg", "description": "Boiled Peanuts"}, "title": "Boiled Peanuts", "directions": "Prepare a slow cooker, add the crab boil, garlic powder, Cajun seasoning, red pepper, jalapenos, salt and peanuts\nPour enough water to cover the peanuts, mix to combine the ingredients\nCover the slow cooker and cook on low until the peanuts are tender (24 hours at least)\nAdd water as needed in the process, stir from time to time\nDrain the peanuts, serve hot or cold", "uuid": "e6150ff6-48aa-4c7c-9f26-d752f6c0e6a2"}]}, {"country": "South Dakota", "recipes": [{"serving": "6", "description": "Chislic is original South Dakota's dish, and it varies slightly in preparation from region to region within the state.", "preparing_time": "75", "title": "Chislic", "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Kegchislicsmall.jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/4/44/Kegchislicsmall.jpg", "description": "Chislic"}, "ingredients": ["1 pound boneless lamb leg, cut into 1-inch cubes", "1 1/2 teaspoons Worcestershire sauce", "3/4 teaspoon chili powder", "3/4 teaspoon kosher salt", "1/2 teaspoon garlic powder", "1/2 teaspoon onion powder", "1/4 teaspoon ground black pepper", "Vegetable oil, for frying"], "directions": "In a large bowl combine the chopped lamb, chilli powder, garlic powder, onion powder, Worcestershire sauce, salt and pepper in a bowl\nLet it sit in the fridge for 1 hour\nPrepare a plate, line with paper towels\nPrepare a dutch oven and heat 2 inches of oil in it to 375°F\nFry the meat in small batches to medium rare (about 1 minute) until the crust is nutty brown and soft\nPlace the lamb cubes onto the lined plate, let drain\nPierce the chislics with toothpicks, serve hot with hot sauce, garlic salt and saline crackers", "uuid": "cbecf740-2785-423b-8163-56f534951f0d"}, {"serving": "8", "description": "This delicious cake is among the South Dakota's national dish, but it originally come from Germany. In Germany. German word \"kuchen\" means \"cake\".", "preparing_time": "90", "title": "Kuchen", "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:K%C3%A4se-Schmand-Kuchen.jpeg", "uri": "https://upload.wikimedia.org/wikipedia/commons/a/a1/K%C3%A4se-Schmand-Kuchen.jpeg", "description": "Kuchen"}, "ingredients": ["#Dough:", "2 cups warm milk", "1/2 cup sugar", "1 (1/4 oz.) package yeast", "6 cups flour", "1/2 cup oil", "1 teaspoon salt", "2 eggs", "#Filling:", "1 quart heavy cream", "6 eggs", "1 cup sugar", "dash salt", "Fruit or topping of choice", "Cinnamon & Sugar mixture"], "directions": "Preheat the oven to 350°F\n#Dough – in a large bowl whisk together all the dough ingredients\nKnead the dough into one piece until smooth and transfer to a well greased bowl\nCover with a plastic wrap and keep in a warm place until doubled in size\n#Filling – prepare a large pan and add all the filling ingredients (except the sugar, cinnamon and fruit), stir on medium heat until thick, then remove from the heat\nPlace the risen dough on a lightly floured surface and form into little balls, then roll into circles big enough to fit in pie pans\nChop your fruit and arrange onto the pie crust, pour with the filling about ½ cup at each kitchen, scatter with cinnamon and sugar\nBake at preheated oven for about 20 minutes, let cool\nServe cool or at room temperature", "uuid": "9ca79a07-7b5d-44e4-9567-19799c9120a1"}]}, {"country": "Tennessee", "recipes": [{"serving": "2", "description": "Bobwhite quail is among the Tennessee state symbols. So let's try this great recipe.", "preparing_time": "50", "title": "Roast Quail", "image": {"source_uri": "https://en.wikipedia.org/wiki/Flamb%C3%A9", "uri": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Cailles_roties_P1150414.jpg", "description": "Roast Quail"}, "ingredients": ["1/4 cup kosher salt", "1 quart water", "2 bay leaves", "4 whole, plucked quail", "Lard, butter or olive oil", "Salt", "2 celery sticks (optional)", "Black pepper", "Lemon wedges (optional)"], "directions": "Pour water or wine in a large pot, season with kosher salt and bay leaves, bring to a boil and then take it off the heat and let cool\nImmerse the quail in the pot and let sit for 2 to 6 hours\nPreheat the oven to 500°F (or the hottest your oven can get)\nTake the quail out from the liquid, pat it dry\nBrush with olive oil, butter or lard and season with salt richly, keep at room temperature\nPrepare a small roasting pan and place the quail in it (they should not touch each other)\nBake in the oven for 10 to 18 minutes (lower end of the spectrum – juicy, little pink on the inside and sappy, higher end – brown, fully cooked, dry)\nTake the quail out of the oven, let it rest for 5-10 minutes, then cut, sprinkle with lemon juice and serve", "uuid": "b64721cd-956a-4f7d-9169-32f0eef88859"}, {"serving": "2 racks", "description": "Memphis-style barbecue is one of the four predominant regional styles of barbecue in the United States, the other three being Carolina, Kansas City, and Texas. It is slow cooked in a pit and ribs can be prepared either \"dry\" or \"wet\".", "preparing_time": "360", "title": "Memphis Ribs", "image": {"source_uri": "https://en.wikipedia.org/wiki/Pork_ribs", "uri": "https://upload.wikimedia.org/wikipedia/commons/5/54/Ribs_from_the_pit.jpg", "description": "Memphis Ribs"}, "ingredients": ["3 tablespoons dark brown sugar", "1 1/2 tablespoons kosher salt", "1 tablespoon ground coriander", "1 tablespoon mustard powder", "1 tablespoon onion powder", "1 tablespoon Spanish paprika", "2 teaspoons garlic powder", "2 teaspoons ground black pepper", "1 teaspoon cayenne", "2 racks St. Louis-style pork ribs (about 2 1/2 pounds per rack)", "1 cup apple cider", "1/2 cup apple cider vinegar", "1/8 cup dark brown sugar"], "directions": "#The marinade – combine the coriander, mustard powder, garlic powder, onion powder, brown sugar, paprika, cayenne and salt\nPrepare the ribs on a dry surface with the underside facing up\nGet rid of the membrane that covers each rib easily with a knife (put it between the membrane and the bone and start pulling the thin layer from the bones)\nRub every rib in the marinade thoroughly\nPrepare a baking sheet and cover with a foil, arrange the ribs on it, cover and refrigerate for at least 3 hours\nPreheat the oven to 300°F\nTake the ribs out of the fridge and place them on the baking tray bone side up\nScatter the baking tray with the apple cider vinegar, cover with another piece of foil, fold the edges to seal properly\nPlace in the preheated oven and bake for 2 hours\nAfter 2 hours, raise the temperature to 375°F, flip the ribs, remove the top foil and bake uncovered for 30 to 45 minutes until the meat is brown and soft\nHeat the apple cider vinegar and the brown sugar in a skillet, bring to a boil and then reduce the heat and cook until a glaze forms (3 minutes)\nTake the ribs out of the oven, glaze with the prepared vinegar glaze, cut and serve", "uuid": "da1851a9-16db-44a5-a1ff-e8bee0093138"}]}, {"country": "Texas", "recipes": [{"serving": "6", "description": "Chilli con Carne is among the Texas' national dishes, but it originally comes from Spain.", "preparing_time": "260", "ingredients": ["1/4 cup ground ancho chili pepper", "1 tablespoon ground chipotle chili pepper", "2 tablespoons ground cumin", "2 teaspoons dried oregano", "1 teaspoon ground coriander", "1/2 teaspoon cinnamon", "1/4 cup cornmeal", "1 (4 pound) beef chuck roast trimmed of excess fat and cut into 1-1/2 inch cubes (see note below)", "8 ounces (about 8 slices) bacon, cut into 1/4-inch pieces (see tip below)", "2 teaspoons salt", "2 small yellow onions, cut into 1-inch chunks", "5 garlic cloves, chopped", "3 jalapeño chiles, cored, seeded and finely diced", "4 cups ( 32 oz) low sodium beef broth", "2 cups water water, plus more for the chili paste and deglazing the pan", "1-1/4 cups lager beer", "1 cup canned crushed tomatoes", "1 tablespoon molasses", "2 teaspoons natural unsweetened cocoa powder"], "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Bowl_of_chili.jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Bowl_of_chili.jpg/1024px-Bowl_of_chili.jpg", "description": "Chili con Carne"}, "title": "Chilli con Carne", "directions": "Prepare a small bowl, add the cumin, coriander, cornmeal, cinnamon, oregano and chilli powders, pour ½ cup of water and mix until you form a paste\nFry the bacon in a large pot over medium heat for about 10 minutes (until the bacon is crispy and there is enough fat in the pan), stirring frequently\nPlace the bacon strips on paper towels to drain\nThrow away all the fat from the pan but a few teaspoons, pour those into a bowl\nPut the pan on medium high heat and start frying the meat (do not overcrowd the pan) until golden brown on one side (about 4 minutes)\nTransfer the meat onto a plate, pour ¼ cup of water into the pot and stir well from the bottom of the pan, reserving all the flavory bits, pour the gravy over the beef\nPour the bacon drippings from the bowl into the pan, heat to medium heat and saute the chopped onions until tender (about 5 minutes)\nAdd the minced garlic and jalapenos, simmer for 2 more minutes and then stir in the chilli paste, combine thoroughly and fry for a few minutes until balmy \nPour the meat broth and whisk properly until the mixture is smooth, scrape the bottom and the edges of the pot\nAdd the beer, crushed tomatoes, water, cocoa powder, and molasses, stir in the bacon and the beef with the gravy, bring to a boil\nCover and reduce the heat to low, stir occasionally, cook for 2 to 3 hours until the meat is tender", "uuid": "6852c5fe-0d19-4593-a58d-6745e33ff86f"}, {"serving": "4", "description": "Tortilla Chips and Salsa are official Texas' state snack. This delicacy is very popular in Texas, but also all around the world.", "preparing_time": "70", "title": "Tortilla Chips and Salsa", "image": {"source_uri": "https://pixabay.com/cs/chipsy-a-salsa-mexick%C3%A9-potraviny-435989/", "uri": "https://pixabay.com/static/uploads/photo/2014/09/04/23/22/chips-and-salsa-435989_640.jpg", "description": "Tortilla Chips and Salsa"}, "ingredients": ["1 small (or ½ large) onion", "1 clove garlic", "2 jalapenos, seeded (seeds added according to spicy level preference)", "1 small bunch cilantro", "¼ teaspoon salt", "¼ teaspoon sugar", "juice and zest of one lime", "1 28-oz can whole tomatoes"], "directions": "Prepare the onion, jalapenos, garlic and cilantro, chop roughly\nTransfer the veggies into a blender, add salt, sugar, lime juice and zest, blend until all the ingredients are finely chopped\nPour the remaining juice, add the tomatoes, blend 5-10 times until smooth (leave a few chunks)\nPut into the fridge for 1 hour\nServe cold with tortilla chips", "uuid": "44c40ed4-07d9-4c35-8610-75812e1c73c2"}]}, {"country": "Utah", "recipes": [{"serving": "10", "description": "People called this dish funeral potatoes because it is commonly served as a side dish during traditional after-funeral dinners.", "preparing_time": "90", "title": "Funeral Potatoes", "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Funeralpotatoesdish.JPG", "uri": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Funeralpotatoesdish.JPG/1280px-Funeralpotatoesdish.JPG", "description": "Funeral Potatoes"}, "ingredients": ["4 tablespoons unsalted butter", "1 small onion, diced (about 1 cup)", "2 cloves garlic, minced", "One 30-ounce bag frozen shredded hash brown potatoes, lightly thawed", "One 10.5-ounce can condensed cream of chicken soup", "1 cup sour cream", "1/4 cup grated Parmesan", "1 1/2 teaspoons kosher salt", "1/2 teaspoon ground black pepper", "2 cups shredded sharp yellow Cheddar", "1 1/2 cups lightly crushed corn flake cereal"], "directions": "Prepare a large saucepan, add 2 tablespoons of butter and let it melt\nAdd the chopped onion, stir until tender and transparent for about 6 minutes, then add the garlic and simmer until soft (another 2 minutes)\nPreheat the oven to 350°F\nCombine the contents of the pan with the hash brown potatoes, sour cream, Parmesan, condensed milk, 1/2 cups of cheddar, sprinkle with salt and pepper\nPour the mixture into a casserole dish, sprinkle with grated cheese, melted butter and corn flakes cereals\nPut it in the oven and bake for approximately 1 hour", "uuid": "c079e5cf-c5f9-4a20-9b5c-48728bd39ae6"}, {"serving": "12", "description": "Gelatin was popularized in the west in the Victorian era with spectacular and complex jelly moulds. Today the Green Jell-O is the official Utah's state snack.", "preparing_time": "60", "title": "Green Jell-O", "image": {"source_uri": "https://en.wikipedia.org/wiki/Jell-O", "uri": "https://upload.wikimedia.org/wikipedia/commons/2/23/Day_18_-_Still_Eating_The_Green_Jello_(gifrancis).jpg", "description": "Green Jell-O"}, "ingredients": ["1⁄2 cup sugar", "1 (6-oz.) package lime Jell-O", "2 tbsp. fresh lemon juice", "1 (8-oz.) can crushed pineapple with its juice", "2 cups heavy cream"], "directions": "Prepare a medium bowl, add 1 cup of boiling water, Jell-O and sugar and whisk until well combined for about 2-3 minutes\nPour the lemon juice, pineapple juice and minced pineapple into the bowl, mix and put into the fridge for 45-50 minutes until syrupy\nPrepare a whipped heavy cream, carefully stir in the Jell-O\nPut the mixture into a pan and put into the fridge until firm, serve cool", "uuid": "b7859e41-9907-480e-9056-3c405517cf3e"}]}, {"country": "Vermont", "recipes": [{"serving": "4", "description": "These wonderful American-style pancakes are light and moist. They are best made fresh and served up for brunch.", "preparing_time": "49", "title": "Buttermilk Pancakes with Maple Syrup", "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Silver_Dollar_Pancakes_with_Blueberry_(5076901336).jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/7/75/Silver_Dollar_Pancakes_with_Blueberry_(5076901336).jpg", "description": "Buttermilk Pancakes with Maple Syrup"}, "ingredients": ["#Maple Syrup Apples:", "2 tablespoons (1/4 stick) unsalted butter", "3 large Golden Delicious apples (about 1 1/2 pounds), peeled, cored, cut into 1/2-inch-thick slices", "1 tablespoon plus 1/2 cup pure maple syrup", "1/2 teaspoon ground cinnamon", "#Pancakes:", "1 cup all purpose flour", "2 tablespoons yellow cornmeal", "2 tablespoons (packed) golden brown sugar", "1 teaspoon baking powder", "1 teaspoon baking soda", "1/2 teaspoon salt", "1 cup buttermilk", "1 cup plain whole-milk yogurt", "1 large egg", "1 1/2 tablespoons unsalted butter, melted", "Additional unsalted butter", "Additional pure maple syrup"], "directions": "#Maple syrup apples – in a large nonstick saucepan melt butter over medium – high heat, stir in 1 tablespoon of maple syrup, the apples, stir fry for about 5 minutes until the apples are soft, add ½ cup of maple syrup and sprinkle with cinnamon\n#Pancakes – in a large bowl combine the first 6 ingredients, pour the egg, buttermilk and yogurt into another bowl, pour the liquid ingredients into the dry ones, whisk until only little lumpy, pour ½ tablespoons of melted butter\nPrepare a large skillet, heat over medium heat\nAdd a piece of butter and create a thin coating on the pan\nFry the pancakes about 1/3 cup of batter each, do not let them touch each other\nCook the batter for about 3 minutes until golden on one side, flip them and cook until done\nArrange the pancakes on the plates, place the maple syrup apples on top of each", "uuid": "1e37a7fe-6b7b-4494-a611-56ef2d1e4cf6"}, {"serving": "9", "description": "It is no wonder that this delicious pie is among the Vermont's national dishes. It is ideal as a dessert at a family dinner.", "preparing_time": "220", "ingredients": ["#Crust:", "2 1/2 cups all-purpose flour, plus extra for dusting", "2 teaspoons sugar", "1 teaspoon salt", "1/2 cup shortening", "1 stick cold unsalted butter, cut into 1/4-inch dice", "1 cup shredded white or yellow Cheddar, cold", "1 teaspoon apple cider vinegar", "3 to 4 tablespoons ice water", "1 large egg", "#Filling:", "6 tablespoons unsalted butter", "6 Cortland apples (about 2 1/2 pounds), peeled and sliced 1/4-inch thick", "6 Granny Smith apples (about 2 1/2 pounds), peeled and sliced 1/4-inch thick", "1 cup sugar", "1 teaspoon lemon zest", "1 tablespoon lemon juice", "3/4 teaspoon ground cinnamon", "1/4 teaspoon ground nutmeg", "Pinch of salt", "3 tablespoons all-purpose flour"], "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Apple_Pie.JPG", "uri": "https://upload.wikimedia.org/wikipedia/commons/3/32/Apple_Pie.JPG", "description": "Vermont Apple Pie"}, "title": "Vermont Apple Pie", "directions": "#Crust – prepare a food processor, pour the salt, sugar and flour into it, mix to combine, toss in the shortening and pulse a couple times to make crumbles\nAdd the cheese and blend to combine, pour the apple cider vinegar and cold water, blend until moist and a little crumbly\nForm the dough into a ball and cover in plastic wrap, split into 2 pieces (one smaller, one bigger)\nPlace into the fridge and cool for at least 1 hour\n#Filling – prepare a large saucepan, melt the butter over a medium heat\nToss in the sugar, lemon juice and zest, nutmeg, cinnamon, salt and apples\nSimmer until the apples release water and the mixture is boiling, about 12 to 15 minutes (the apples must be soft, but not overcooked)\nScatter with flour and simmer until the mixture thickens, approximately 1 minute more\nTransfer the apples onto a baking sheet, spread them evenly and let them cool in room temperature about 1 hour\nPreheat the oven to 425°F, place a baking sheet in the oven to heat\nRoll the dough to 12 inches in diameter and 1/8 inch thick, place on the deep dish pie pan, cut the overhanging edges to ½ inch\nPour the filling onto the pie crust\nTake the other dough, roll into the same thickness and about 10 inches in diameter, top the filling with it, crimp the edges and fold them under\nMake holes into the top dough\nCoat the top with a whisked egg with water\nPut the pie onto the preheated sheet, bake for 10 minutes\nAfter 10 minutes reduce the temperature to 350°F, bake until the crust is light brown and crispy, approximately 50-60 minutes", "uuid": "257a1d06-6971-433e-8692-765c694bbe47"}]}, {"country": "Virginia", "recipes": [{"serving": "12", "description": "Ham Biscuits are also known as an \"angel biscuits\" or \"bride's biscuits\". Almost any garden party is complete without these lightened breads.", "preparing_time": "40", "ingredients": ["3 cups all-purpose flour, plus more for dusting", "1 tablespoon baking powder", "1 1/2 teaspoons kosher salt", "1 teaspoon baking soda", "2 tablespoons chopped fresh chives", "8 tablespoons cold lard, cut into small chunks", "1 1/2 cups buttermilk", "1/4 cup whole grain mustard", "1 tablespoon honey", "1 teaspoon Dijon mustard", "8 ounces ham, sliced 1/4-inch thick, from a bone-in or boneless ham"], "image": {"source_uri": "http://www.freestockphotos.biz/stockphoto/17054", "uri": "http://res.freestockphotos.biz/pictures/17/17054-a-basket-of-fresh-rolls-pv.jpg", "description": "Ham Biscuits"}, "title": "Ham Biscuits", "directions": "Prepare a large bowl, combine the baking powder, flour, baking soda and chives\nPreheat the oven to 400°F\nAdd the lard to the blender and process it until crumbly\nForm a hole in the center of the dough and pour in the buttermilk, add the lard and stir gently until a smooth batter forms\nPlace the batter on a floured surface, knead again about 5 times\nRoll the dough onto a 1 inch thick layer, cut the biscuits with a 2 ½ inch cutter\nPrepare a baking sheet and arrange the dough circles on it, bake for about 20 minutes until puffy and nutty brown, let them cool on a wire rack\nIn another bowl stir the honey, Dijon mustard and whole grain mustard\nTop each cold biscuit with the honey mustard, the ham and biscuit top\nServe at room temperature", "uuid": "09d5e484-4d59-40bb-8db1-609b7d28e8d9"}, {"serving": "6 to 12", "description": "These delicious muffins are among the Virginia's national dishes. They are wonderful with cup of tea or coffee.", "preparing_time": "35", "title": "Blueberry Muffins", "image": {"source_uri": "https://www.flickr.com/photos/ipalatin/7590898848", "uri": "https://c2.staticflickr.com/8/7136/7590898848_97bcbf7f27_b.jpg", "description": "Blueberry Muffins"}, "ingredients": ["1.5 cups flour", "3/4 cups white sugar", "1/2 tsp salt", "2 tsp baking powder", "1/2 cup vegetable oil", "1 egg", "1/3 cup milk", "1 cup fresh blueberries", "#Crumb topping:", "1/2 cup white sugar", "1/3 cup flour", "1 1/2 tsp ground cinnamon", "1/4 cup butter, cubed"], "directions": "In a bowl mix the flour, sugar, baking powder and salt\nPreheat the oven to 400°F\nPrepare the muffin cups or muffin liners (grease them)\nPour oil into a 1 cup measure, add the egg and milk (fill to the brim)\nAdd to the flour mixture, mix just until combined\nStir the blueberries carefully in the bowl\n#Crumb topping – combine cinnamon, sugar and flour, add enough butter and form little crumbs\nFill the muffin paper cups to the top, scatter with the crumb topping\nBake in the oven for 20-25 minutes", "uuid": "16e2594c-c8c8-4b69-81e3-231a3d6297ad"}]}, {"country": "Washington", "recipes": [{"serving": "4", "description": "Steelhead trout is among the Washington's state symbols. So here is one perfect recipe.", "preparing_time": "30", "ingredients": ["1 lb steelhead fillet, with or without skin", "1 clove garlic, chopped fine", "1 1⁄2 tablespoons coarsely chopped fresh rosemary", "1 lemon, zest of", "1⁄2 lemon, juice of", "1⁄4 teaspoon salt", "1⁄2 teaspoon fresh ground pepper", "1 tablespoon olive oil, plus", "additional oil, for greasing baking pan"], "image": {"source_uri": "https://pixabay.com/cs/photos/salmon/", "uri": "https://pixabay.com/static/uploads/photo/2014/11/05/15/57/salmon-518032_640.jpg", "description": "Broiled Steelhead Trout"}, "title": "Broiled Steelhead Trout", "directions": "Preheat a broiler\nLine and grease the baking pan\nCombine all the ingredients but the trout into a smooth paste\nOn the prepared baking sheet arrange the trout skin side down, sprinkle with seasoning\nPlace the trout 2 levels from the heat and cook for approximately 5 minutes \nTransfer the trout to another rack (3rd or 4th), reduce the heat to 325°F\nBake for another 10 minutes or until the fish is tender\nServe hot with salad, steamed vegetables or orzo salad", "uuid": "4c989101-94a8-4c1b-993b-c595ce81c336"}, {"serving": "6", "description": "Grilling the salmon on water-soaked cedar plank give it delightfully unusual smoky taste.", "preparing_time": "150", "ingredients": ["2 tablespoons grainy mustard", "2 tablespoons mild honey or pure maple syrup", "1 teaspoon minced rosemary", "1 tablespoon grated lemon zest", "1 (2-pounds) salmon fillet with skin (1 1/2 inches thick)", "cedar grilling plank (about 15 by 6 inches)"], "image": {"source_uri": "https://www.flickr.com/photos/joeyparsons/3691823199", "uri": "https://c1.staticflickr.com/3/2588/3691823199_746ac19f47_b.jpg", "description": "Cedar Plank Salmon"}, "title": "Cedar Plank Salmon", "directions": "Prepare the cedar grilling plank by keeping it in water for 2 hours before cooking\nPrepare the grill for cooking on direct heat over medium high gas (or medium for charcoal), open the vents on the bottom and the lid\nCombine the honey, mustard, zest, rosemary, season with ½ teaspoon of salt and pepper\nBrush the meat with the mixture on both sides, let it sit for 15 minutes\nPlace the salmon on the plank (skin side down) and grill covered for 13 to 15 minutes until the edges of the salmon are lightly brown\nKeep the salmon on the plank for 5 minutes, serve", "uuid": "a30627ca-7e46-4558-a7fd-4bf1be100d81"}]}, {"country": "West Virginia", "recipes": [{"serving": "2 to 3 cups", "description": "Traditionally, apple butter was prepared in large copper kettles outside. Large paddles were used to stir the apples, and family members would take turns stirring. And also the Golden Apples are the official state fruit.", "preparing_time": "210", "title": "Apple Butter", "image": {"source_uri": "https://www.flickr.com/photos/whitneyinchicago/4073024972", "uri": "https://c1.staticflickr.com/3/2446/4073024972_bd2f1e0f1c_b.jpg", "description": "Apple Butter"}, "ingredients": ["4 pounds assorted apples, peeled and chopped", "2 cups apple cider", "1 cup packed light brown sugar", "Kosher salt", "1 tablespoon fresh lemon juice", "1 teaspoon ground cinnamon", "1 teaspoon vanilla extract", "Pinch of ground cloves"], "directions": "Preheat a dutch oven over medium heat, add the apple cider, brown sugar, apples and ½ teaspoon of salt\nCook almost completely covered for about 20 minutes until the apples are tender\nTurn off the heat, pour the lemon juice and season with cloves, vanilla and cinnamon\nTransfer the mixture into a blender, pulse until fine\nPlace the apple puree back onto the pan and simmer for 2 to 3 hours (depends what kind of apples you used) until it turns thick and golden, stir every 30 minutes\nTurn off the heat, let it cool completely and store for up to 5 days", "uuid": "b4807ba3-bd50-4681-ace2-3c87eb1fc6fd"}, {"serving": "20", "description": "The pepperoni roll was created by Giuseppe \"Joseph\" Argiro at the Country Club Bakery in Fairmont, West Virginia, in 1927. Today it is a popular snack also in other countries.", "preparing_time": "130", "title": "Pepperoni Roll", "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:PepperoniRolls.jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/d/d3/PepperoniRolls.jpg", "description": "Pepperoni Roll"}, "ingredients": ["1 cup warm water (100 degrees F/40 degrees C) ", "1/2 teaspoon white sugar ", "1 (.25 ounce) package active dry yeast ", "5 cups all-purpose flour", "3/4 cup white sugar ", "2 teaspoons salt ", "2 eggs, beaten ", "1/2 cup butter, melted ", "1 (8 ounce) package sliced pepperoni"], "directions": "Preheat the oven to 350°F, brush a cookie sheet with oil\nIn a small bowl combine 1 cup of warm water and ½ teaspoon of sugar, scatter with yeast and set aside for 5 minutes\nIn another bowl mix ¾ cup of sugar, salt and flour, pour in the yeasty water and add eggs and melted butter\nWhen the dough sticks together, transfer onto a floured surface and knead until flexible and fine (8 minutes)\nGrease a large bowl with oil, put in the dough and brush from all sides, cover with a linen cloth and let sit in warm place until double the size (about 1 hour and 30 minutes)\nForm the dough back to it's normal size, make 20 balls\nPush each ball with your hands into a 4 inch square rectangle, add 3 slices of pepperoni to the center of each roll and 3 more next to it\nFold the dough over the pepperonis, seal the edges properly, arrange onto the cookie sheet\nBake for 14 to 16 minutes until golden brown", "uuid": "f256c6fc-846b-41af-ba2d-84c457b68999"}]}, {"country": "Wisconsin", "recipes": [{"serving": "9", "description": "The cake dates back to early colonial times in the United States. There is also the National Applesauce Cake Day on June 6 in the U.S.", "preparing_time": "50", "title": "Applesauce Cake", "image": {"source_uri": "https://commons.wikimedia.org/wiki/File:Applesauce_walnut_coffee_cake.jpg", "uri": "https://upload.wikimedia.org/wikipedia/commons/e/e2/Applesauce_walnut_coffee_cake.jpg", "description": "Applesauce Cake"}, "ingredients": ["2 c. flour", "1½ tsp. baking soda", "1 tbsp. cocoa", "1½ tsp. cinnamon", "1 tsp. nutmeg", "1 tsp. all psice", "1 tsp. cloves", "1 tsp. salt", "1½ c. sugar", "½ c. shortening", "2 c. applesauce", "2 eggs", "1 c. chopped nuts, divided", "1 c. chocolate chips, divided", "½ c. raisins", "½ c. diced dry apples"], "directions": "Preheat the oven to 350°F\nWhisk together the shortening and sugar, stir in the eggs and mix well \nIn a medium bowl mix all the dry ingredients and pour into the creamy mixture along with applesauce\nToss in the nuts, half of the chocolate chips, dry apples and raisins\nPour the mixture into 2 pie pans\nSprinkle with 2 tablespoons of brown sugar and the rest of the chips and nuts\nBake for 30-35 minutes", "uuid": "6396ca2f-4cfd-4a64-b7d1-5cb97eeca034"}, {"serving": "2 kringles", "description": "This delicious pastry is among the Wisconsin's national dishes. But originally it came from Scandinavia.", "preparing_time": "150", "title": "Kringle", "image": {"source_uri": "https://en.wikipedia.org/wiki/Kringle", "uri": "https://upload.wikimedia.org/wikipedia/commons/7/78/Kringle.jpeg", "description": "Kringle"}, "ingredients": ["#Kringle:", "3/4 cup butter", "1 package dry yeast", "1/4 cup lukewarm water", "1/4 cup lukewarm milk", "1/4 cup sugar", "1/2 teaspoon salt", "1/2 teaspoon lemon extract", "1 egg", "2 cups sifted all-purpose flour", "#Filling:", "1 cup brown sugar", "1/3 cup butter", "Pinch salt", "Pinch cinnamon", "1 to 2 egg whites", "Fruit, nuts, raisins or jam, of choice"], "directions": "Prepare the butter, soften it using potato masher and spread on a waxed paper, let cool\nPut the yeast in warm water and let dissolve, then add salt, lemon extract, egg and milk, stir properly\nScatter with flour and knead with your hands into a ball of dough\nCover with plastic wrap and cool \nPlace the dough on a lightly floured surface and roll into an 8 by 12 inch rectangle\nDivide the butter layer in half\nPlace 1 half onto 2/3 of the dough\nFold the uncovered part over half of the buttered part, then fold the remaining third over the top, chill\nRoll the dough to an 8 by 12-inch rectangle again. Place the rest of the butter layer onto 2/3 of the dough. Fold the same way as before.\nRoll the dough to an 8 by 16-inch rectangle (be careful not to break the layering of butter).\nFold in thirds (like above), now you'll have 24 layers of butter, chill\nCut the dough into halves, carefully roll 1 piece at a time until it's about 6 by 20 inches\n#Filling – combine all the ingredients until fine, brush the middle third with the filling, add nuts, raisins or jam and fruit\nCover with one edge, water the other one and fold over it, tighten it properly\nPreheat the oven to 350°F\nArrange the Kringle into an oval shape and place on a baking sheet, push the dough a little, let it rest covered in room temperature for 1 hour\n#Ice – combine water and powdered sugar\nBake until golden for 20-25 minutes, chill, glaze with the powder sugar mixture", "uuid": "bab21234-a024-4624-a1da-fee1f86c0fe5"}]}, {"country": "Wyoming", "recipes": [{"serving": "15", "description": "Native Americans, trappers, and early settlers in Wyoming territory ate dried meats (buffalo, elk, moose, deer, beef).", "preparing_time": "900", "ingredients": ["4 lbs london broil beef or 4 lbs flank steaks", "2 teaspoons black pepper", "2 teaspoons chili powder", "2 teaspoons garlic powder", "2 teaspoons cayenne pepper, more if you like it hot", "2 teaspoons onion powder", "1 teaspoon liquid smoke", "1⁄4 cup soy sauce or 1⁄4 cup low sodium soy sauce", "1⁄2 cup Worcestershire sauce", "1⁄2 cup Frank's red hot sauce"], "image": {"source_uri": "https://pl.wikipedia.org/wiki/Jerky", "uri": "https://upload.wikimedia.org/wikipedia/commons/6/65/Beef_jerky.jpg", "description": "Jerky"}, "title": "Jerky", "directions": "Cut off all the fat from the meat\nChop the meat into strips about 4 inches long and ½ inches thick\nPlace the strips into a freezer and cut when slightly frozen\nGrind the meat a little\nIn a large bowl mix all the ingredients\nCover with plastic wrap and place into the fridge for at least 8 hours\nPreheat the oven to 150-175°F\nPrepare a cookie sheet and line it with tinfoil\nArrange the strips onto it, they can not touch each other\nBake for 6 hours, flip them after 3 hours\nWhen the slices are dry, you can serve or store for later", "uuid": "9191e397-bddc-4912-890d-36d797fa6064"}, {"serving": "6", "description": "The Shoshone who were the first inhabitants of the Yellowstone area were known as sheep-eaters. So here is one Wyoming's original lamb recipe.", "preparing_time": "25", "ingredients": ["1 1⁄2 Pound Lamb shoulder", "3⁄4 Cup (12 tbs) French dressing", "1 Clove (5 gm) Garlic ", "1⁄2 Pound (optional) Button mushrooms ", "4 Bacon slices", "Salt\t1 Teaspoon", "1⁄4 Teaspoon Pepper"], "image": {"source_uri": "https://en.wikipedia.org/wiki/List_of_Israeli_dishes", "uri": "https://upload.wikimedia.org/wikipedia/commons/1/17/Shashlik.jpg", "description": "Lamb Kabobs"}, "title": "Lamb Kabobs", "directions": "Place an oiled broiler rack 3 to 4 inches from the heat, preheat the broiler\nChop the meat into cubes\nPrepare a large glass bowl, add the garlic, dressing and meat and cool in the fridge for at least 1 hour \nChop the bacon into 1 inch stripes\nPrepare metal skewers and arrange the lamb, mushrooms and bacon on them, sprinkle with salt and pepper\nPut it in the prepared broiler rack and cook for 15 minutes, flip it twice\nServe hot, decorate with mint relish", "uuid": "ac7896f1-6885-466e-accf-9b5e1e87384f"}]}], "id": "uuid"}]